[
  "<p><photo1></p>\n<p>Two weeks into the NHL season and we're right back in it. After covering six games in six cities, here's the latest buzz I've heard from conversations around the rink.</p>\n\n\n<hr>\n\n\n<h2>What's next for Kane?</h2>\n\n\n<p>The greatest American active player, just one year removed from a 92-point season, is a free agent and will be ready to play around midseason. And nobody knows where he's going to end up.</p>\n<p>Patrick Kane is 4½ months out from <a href=\"https://www.espn.com/nhl/story?id=37775741&_slug_=patrick-kane-4-6-months-hip-resurfacing-surgery\">hip resurfacing surgery</a>. He's been rehabbing mostly in Toronto, some in Chicago, under the guidance of Dr. Ian MacIntyre. Kane recently has been cleared for contact. His agent, Pat Brisson, told me that in early November they'll take serious calls from suitors, and Kane is looking to join a team in November or December. Kane, 34, is not in a rush; the priority is to ensure he's 110% healthy. Hampered by the hip, Kane played last season basically on one leg. Kane also wants the right fit -- entering the right environment, on a team with serious chances to win.</p>\n<p>Brisson told me it's way too early to speculate on teams, but here are a few intriguing things I know. Kane's hometown <a href=\"http://www.espn.com/nhl/team/_/name/buf/buffalo-sabres\">Buffalo Sabres</a> are keeping tabs. Kane has personal relationships with GM Kevyn Adams and coach Don Granato. A few years ago, Kane playing in Buffalo was completely out of the question for him, but dynamics have changed and he's open to the idea right now.</p>\n<p><alsosee></p>\n<p>The <a href=\"http://www.espn.com/nhl/team/_/name/det/detroit-red-wings\">Detroit Red Wings</a> have been one of the early surprises of the season. The player seeing the most success in Detroit? <a href=\"http://www.espn.com/nhl/player/_/id/4063433/alex-debrincat\">Alex DeBrincat</a>, the former Blackhawks winger Kane considers one of his favorite linemates ever. I've heard the <a href=\"http://www.espn.com/nhl/team/_/name/fla/florida-panthers\">Florida Panthers</a> let Kane's camp know this summer they're interested. The <a href=\"http://www.espn.com/nhl/team/_/name/dal/dallas-stars\">Dallas Stars</a> looked into acquiring Kane at last year's trade deadline, when he ultimately went to the Rangers, and likely will revisit things. The Avs have been mentioned to me as a sleeper team, though they'd need to tinker with their roster to clear room.</p>\n<p>Bottom line: There's a lot of interest in Kane. On a short term, low-cost deal, why not take the flier? But you can count out the team Kane played for for his first 16 years. Although Kane and the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a> are on good terms after last season's trade, the door is closed for now as Chicago is in a rebuild.</p>\n\n\n<hr>\n\n\n<h2>Latest on Landeskog's possible return</h2>\n <photo2>\n<p>The <a href=\"http://www.espn.com/nhl/team/_/name/col/colorado-avalanche\">Colorado Avalanche</a> look as legit a Stanley Cup contender as anyone, winning their first six games with a plus-15 goal differential. But looming all season will be the absence of captain <a href=\"http://www.espn.com/nhl/player/_/id/2562609/gabriel-landeskog\">Gabriel Landeskog</a>. And while the team is \"cautiously optimistic\" he can return for the playoffs, there's still so much unknown. \"It's really uncharted territory,\" GM Chris MacFarland told me last week.</p>\n<p>The 30-year-old forward hasn't played since the day the Avs won the Cup in 2022. He missed the start of last season rehabbing a right knee injury -- but couldn't get well enough to return. So in May, Landeskog opted for a dramatic attempt to salvage his career: <a href=\"https://www.espn.com/nhl/story?id=37588722&_slug_=avalanc-gabriel-landeskog-having-cartilage-transplant\">knee cartilage transplant</a>.</p>\n<p>No NHL player has ever come back from that surgery. Coincidentally, Chicago Bulls guard Lonzo Ball is trying to become the first NBA player to come back from a knee cartilage transplant. Ball is about two months ahead of Landeskog in rehab, and the athletes and their front offices have been trading notes. (Arturas Karnisovas, the Bulls' VP of basketball ops, previously worked for the Nuggets and has a relationship with MacFarland).</p>\n<p>Landeskog is spending most of the season in Toronto doing his rehab. He'll come to Denver from time to time, but he doesn't want to take away treatment time from his teammates who need to get game-ready. Landeskog, whose wife is from Toronto, has better resources for dedicated medical time in his offseason home.</p>\n<p>MacFarland said he won't start to get excited about the idea of Landeskog returning until he is cleared for more intense skating, such as stops and starts. That's still months away. MacFarland said the issue is that Landeskog will probably start to feel good in a few months, but if he has one setback, they're back to square one if he must redo the surgery. So although the Avalanche are optimistic about Landeskog's early reports -- his rehab has been going very well, no hiccups so far -- the team is taking a cautious approach, knowing Landeskog's career hangs in balance.</p>\n<p>Landeskog is under contract through 2029. \"We're going to do what's best for Gabe long term,\" MacFarland said.</p>\n\n\n<hr>\n\n\n<h2>Poitras in the middle in Boston</h2>\n\n\n<p><photo3></p>\n<p>One of the best stories of the young season is the emergence of 19-year-old Bruins center <a href=\"http://www.espn.com/nhl/player/_/id/5080221/matthew-poitras\">Matthew Poitras</a>. Boston has struggled in drafting and developing centers over the past few years, and it is thin at the position after the dual retirements of Patrice Bergeron and David Krejci. Enter Poitras, a 2022 second-round pick. Poitras' agent, John Walters, met with the teenager in the middle of summer. As the two said goodbye in the driveway, Walters said: \"You know, the Bruins lost Bergeron and Krejci. You can make the team, you just gotta believe how good you are. Don't go in there thinking you'll be sent back to juniors.\"</p>\n<p><inline1></p>\n<p>Poitras' response? \"Oh, I plan on it.\"</p>\n<p>Poitras has a quiet confidence. He told me he doesn't like being in the center of attention but credited <a href=\"http://www.espn.com/nhl/player/_/id/3852/brad-marchand\">Brad Marchand</a> specifically for being so friendly and funny to be around, which has made him feel included. That's the Bruins culture.</p>\n<p>The day before a game last week, Walters called Poitras at the hotel -- where he's currently living in Boston -- and asked what he was doing. Homework.</p>\n<p>Poitras is enrolled in college courses, required by his junior team. He's taking microeconomics. \"I hate it,\" Poitras admitted to me. He'd much rather just be a professional hockey player.</p>\n<p>Thursday, Nov. 2, against Toronto will be Poitras' 10th NHL game -- the point where Boston has to decide whether to send Poitras back to juniors or if he's staying for the season. The Bruins have not been in this position with a player in 20 years, when Bergeron was a rookie. So they told Poitras they'd take it day by day. Every time the Bruins thought Poitras might dip, he finds a way to level up. The Bruins' third game of the season, against San Jose, was Poitras' worst as a pro. He followed it up two games later with a two-goal performance against the Ducks, then scored again in the next game against the Blackhawks.</p>\n<p>Boston will use the three-game homestand leading up to the Toronto game to decide Poitras' future. But unless he takes a serious dip, it looks as if he's staying -- and can dip out of that econ class.</p>\n\n\n<hr>\n\n\n<h2>Bedard off to strong start </h2>\n\n\n<p>So much attention has been focused on <a href=\"http://www.espn.com/nhl/player/_/id/5149125/connor-bedard\">Connor Bedard</a> to begin his rookie season, and he has lived up to the hype. From an off-ice perspective, I give a ton of credit to the 18-year-old for being professional and accommodating with how many requests he's gotten. \"He just gets it\" is a phrase I've heard a lot around the Blackhawks. For his very first NHL game, Bedard did a media scrum after morning skate, a first-period intermission interview with me, second-period intermission with Sportsnet and postgame with me followed by general availability. That's incredible accessibility.</p>\n<p><inline2></p>\n<p>New NHLPA boss Marty Walsh has made this an emphasis. As he goes around and meets with players, he is explaining that if they want hockey-related revenue to rise -- which would increase the salary cap, and eventually decrease the dreaded escrow -- guys need to put themselves out there more. Visibility and creating narratives around the game is important. Hockey players have traditionally been trained to think that was selfish. Now they're being taught it's actually selfless, creating more prosperity for the future generations.</p>\n<p>On the ice, Bedard expects to score every game. You can see his frustration when it's not there, but he's learning to manage it. Coach Luke Richardson said Bedard is used to the extra coverage on the ice; he's seen it for years in juniors. When he is being shadowed on the power play -- in the same way teams treat <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> or <a href=\"http://www.espn.com/nhl/player/_/id/5037/steven-stamkos\">Steven Stamkos</a> -- Bedard is learning he needs to move. Look for him to start switching places with <a href=\"http://www.espn.com/nhl/player/_/id/3041992/seth-jones\">Seth Jones</a> in these scenarios. At 5-on-5, Bedard is excellent at drawing two defenders, then using his hockey sense to make a pass and find open ice. Bedard isn't afraid to drive the middle of the ice, but he also tends to try taking on guys 1 vs 3, which is hard to do at the NHL level.</p>\n<p>Overall, Richardson would like to see Bedard shoot more. The rookie is sometimes waiting for the perfect pass or shot, but with his lethal shot, Richardson believes Bedard will be able to sneak it through defenders and past goalies more often.</p>\n\n\n<hr>\n\n\n<h2>Balancing now and the future in Pittsburgh</h2>\n\n\n<p>There was renewed energy around the Penguins ahead of the season. Trading for <a href=\"http://www.espn.com/nhl/player/_/id/5164/erik-karlsson\">Erik Karlsson</a>, coming off a 100-point season, set the tone. But new GM Kyle Dubas did more work than that. He brought in several players to training camp on PTOs, which created real competition. Dubas also rounded out the team's depth; Pittsburgh's bottom six finally has an identity, and there are a handful of players ready for call-up in Wilkes-Barre who have a couple hundred games of NHL experience.</p>\n<p>Although Dubas gave the Penguins some quick fixes to maximize this season -- another one where it appears core players <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a>, even entering their mid-30s, are still playing at elite levels -- he's clearly balancing future concerns. Example: the contract situation for <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a>.</p>\n<p>Guentzel loves playing in Pittsburgh, and the Penguins love Guentzel. As coach Mike Sullivan told our broadcast team before the opener, \"Sure, a lot of players can play with Sidney Crosby, but not all of them can score 40 goals.\" Sullivan called Guentzel a \"superstar.\" But the 29-year-old winger is on the final year of a five-year deal ($6 million AAV) and contract talks are on hold for now. From what I've heard, Dubas wants to see how the team does this season to get a better understanding of where the Penguins are before making any commitment.</p>\n<p>Guentzel, for his part, has six points in his first five games. It seemed as if he was going to miss at least the first five games of the season after summer ankle surgery. However, I am told that Guentzel \"hated\" the conservative timeline the Pittsburgh medical staff assigned him. He circled the home opener on Oct. 10 and knew he wouldn't miss it. He's a man on a mission this year.</p>\n\n\n<hr>\n\n\n\n<h2>Trouble in Tampa?</h2>\n\n\n<p>The <a href=\"https://www.espn.com/nhl/team/_/name/tb/tampa-bay-lightning\">Tampa Bay Lightning</a>'s emphasis this offseason was on improving defensively. GM Julien BriseBois told me that when they were winning Stanley Cups, they were a top-six or top-eight defensive team. He felt they lost their way last season and gave up too many scoring chances. So the Tampa Bay coaching staff, led by coach Jon Cooper, made an adjustment to the system. And the roster changes BriseBois made in the offseason (bringing in <a href=\"http://www.espn.com/nhl/player/_/id/5266/calvin-de-haan\">Calvin de Haan</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3042138/tyler-motte\">Tyler Motte</a>, <a href=\"http://www.espn.com/nhl/player/_/id/2335062/luke-glendening\">Luke Glendening</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3149827/conor-sheary\">Conor Sheary</a>, <a href=\"http://www.espn.com/nhl/player/_/id/5556/austin-watson\">Austin Watson</a>) had that in mind. All the while, the team is feeling the pinch from trading prospects and draft picks for Stanley Cups -- they've drafted a first-rounder just once since 2019 and are without first-round picks again in 2024 and 2025.</p>\n<p>Cooper told me his message this year was simple. When you get knocked out of the playoffs in the first round, and have your longest offseason in five years, guys should come back angry and hungry. Tampa has a group that plays with a lot of pride, one that possibly could withstand losing star goalie <a href=\"http://www.espn.com/nhl/player/_/id/2976847/andrei-vasilevskiy\">Andrei Vasilevskiy</a> until December.</p>\n<p>But the team just isn't as balanced as it used to be. The flat salary cap forced the team to say goodbye to several stalwarts this summer -- <a href=\"http://www.espn.com/nhl/player/_/id/4968/alex-killorn\">Alex Killorn</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3853/pat-maroon\">Pat Maroon</a>, <a href=\"http://www.espn.com/nhl/player/_/id/2273/corey-perry\">Corey Perry</a>, <a href=\"http://www.espn.com/nhl/player/_/id/4392471/ross-colton\">Ross Colton</a>, <a href=\"http://www.espn.com/nhl/player/_/id/4991/ian-cole\">Ian Cole</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3111908/pierre-edouard-bellemare\">Pierre-Edouard Bellemare</a> -- and early injuries have exposed their lack of depth.</p>\n<p>• The fact that captain <a href=\"http://www.espn.com/nhl/player/_/id/5037/steven-stamkos\">Steven Stamkos</a>, a pending UFA, didn't get a contract offer this summer is a big topic ... but we might not get answers on his future for a while. BriseBois told Stamkos and his representatives they would wait until after the season to negotiate, waiting to see how the year goes.</p>\n<p>Stamkos also had difficult negotiations in 2016 before ultimately signing a mega eight-year contract two days before he was set to hit free agency. I've talked to two of Stamkos' friends, and they said the same thing: \"This one feels different.\" I've also talked to some of Stamkos' ex-teammates on the road who believe that it will ultimately get sorted out, that everyone just needs a little time and space. Stamkos clearly wants to remain with the Lightning. But he has seen other players get taken care of and wants to be paid what he believes he's worth -- not just take whatever is left over. BriseBois has said he wants Stamkos to retire in Tampa Bay but also to be contending for Cups while he's doing it. Given the current state of the team, you can see the chasm.</p>\n\n\n\n\n",
  "<p>CRANBERRY, Pa. -- <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> couldn't believe what he was hearing.</p>\n<p>He knew the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> were going to do something dramatic in the offseason after missing the Stanley Cup playoffs for the first time in 16 seasons. The team's management, including new president of hockey operations Kyle Dubas, would occasionally let Crosby in on their plans during the summer, including potential trade targets. Which was only appropriate, given that any moves they made were in service of sliding a fourth Stanley Cup ring onto the captain's hand.</p>\n<p>During one conversation with Crosby, the Penguins mentioned they were pursuing a rather intriguing name: <a href=\"http://www.espn.com/nhl/team/_/name/sj/san-jose-sharks\">San Jose Sharks</a> star defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5164/erik-karlsson\">Erik Karlsson</a>.</p>\n<p>\"I was just excited, you know? He's a special player,\" Crosby told ESPN. \"But you try to manage your expectations. I mean, it was far from happening. I think three teams that were in on it. I was hearing Carolina. I was hearing Seattle. So I didn't get my hopes up too much.\"</p>\n<p>Penguins coach Mike Sullivan was collaborating with Dubas on ways to reshape the team around Crosby. He didn't expect Karlsson to be an option.</p>\n<p>\"We felt we needed a legitimate top-four defenseman. We felt like that was a priority that we needed to address in order to put our team in a better position to contend,\" he said. \"I didn't envision acquiring the Norris Trophy winner. I didn't see that one coming. For me to sit here and say, 'Yeah, I expect to get a player like Erik Karlsson' ... I'd be lying to you if I told you that.\"</p>\n<p>Crosby understood the obstacles in acquiring Karlsson. Could the Penguins outbid other suitors? Could they make the necessary financial moves to create the salary cap space for Karlsson's considerable contract: $11.5 million against the salary cap through 2026-27? Would Karlsson waive his full no-movement clause for a trade to Pittsburgh?</p>\n<p>That last obstacle was in fact the simplest to traverse.</p>\n<p>\"I've been pretty transparent about it: This was a hockey decision and nothing else. And if you view it that way, then there's not been many better places, I think, than being a part of the Pittsburgh Penguins,\" Karlsson told ESPN. \"I mean, I battled these guys my whole career. I don't think that they have to sell me on anything.\"</p>\n<p>On Aug. 6, <a href=\"https://www.espn.com/nhl/story/_/id/38144636/erik-karlsson-penguins-3-team-trade-sharks-canadiens\">a three-team trade</a> among the Penguins, Sharks and <a href=\"http://www.espn.com/nhl/team/_/name/mtl/montreal-canadiens\">Montreal Canadiens</a> took care of the cap complications and delivered Karlsson to Pittsburgh. A three-time Norris Trophy winner, with 761 points in 921 career games with Ottawa and San Jose. The player who could lead the Penguins back not only to the postseason but potentially to another Stanley Cup celebration.</p>\n<p>If all of this works, of course.</p>\n<p><offer></offer></p>\n<hr>\n<p><strong>CROSBY AND KARLSSON</strong> have had a peculiar friendship through the years.</p>\n<p>The Penguins and Senators engaged in some epic battles. That included three playoff series, with their 2017 Eastern Conference finals decided in Game 7 on a double-overtime goal by then-Penguin Chris Kunitz.</p>\n<p>\"We fought hard. We both tried to beat each other and each other's teams. But think we each had respect for each other too, whether we were winners or losers,\" Karlsson said of Crosby. \"Unfortunately, he came out on top a little bit too many times, so maybe it was easier on his part.\"</p>\n<p>For Crosby, Karlsson wasn't just a fierce opponent. For whatever reason, they clicked on a personal level despite never having been teammates.</p>\n<p>\"Yeah, it's funny. I'm not a guy that likes to chat a ton on the ice. He's just a pretty chatty guy out there. I always end up chatting with him for some reason, right from his early days in Ottawa, and then I'd see him at league events and stuff like that,\" Crosby said. \"He's just a great guy. Really easy-going. But it was funny: When he first came into the league, I always ended up having the odd convo with him, which is pretty rare for me. So I feel like I've known him for longer than I have.\"</p>\n<p>The player forever known as \"Sid the Kid\" is 36 years old and in his 19th season. His hair now has some stately gray in it -- not the full <a href=\"https://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Ovechkin</a> but just enough to signify the passage of time. His last Stanley Cup win was in 2017, and the Penguins have won only a single playoff round since then, including their postseason miss in 2022-23.</p>\n<p><alsosee></p>\n<p>For other franchises, this lack of championship success with an aging roster -- the average age of the 2023-24 Penguins is 30.8 years old, highest in the NHL -- would have meant the end of an era. But this rule didn't apply to a team with Crosby still putting up 93 points in 82 games.</p>\n<p>When Dubas was hired this summer, after a public falling-out with the <a href=\"http://www.espn.com/nhl/team/_/name/tor/toronto-maple-leafs\">Toronto Maple Leafs</a>, his task was to build toward a post-Crosby era while maximizing the current core's window to win.</p>\n<p>Two years ago, it looked as if that core might be demolished: Center <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> and defenseman <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a> were unrestricted free agents. But Pittsburgh retained them both on multiyear contracts -- to the delight of Crosby -- and sought to build a new contender around this holy hockey trinity.</p>\n<p>Letang, 36, remains one of the NHL's best puck-moving defensemen, and he skated 24:51 per game last season in 64 appearances. Karlsson arrives having tallied 101 points in 82 games to win the Norris, skating 25:37 per contest.</p>\n<p>\"They both think the game extremely well. I think Karlsson may try to beat guys one-on-one a little bit more, things like that. Whereas Tanger really utilizes the guys around him,\" said defenseman <a href=\"http://www.espn.com/nhl/player/_/id/3042122/ryan-graves\">Ryan Graves</a>, who left New Jersey for the Penguins as a free agent. \"At the same time, they create space themselves. They create space for other players in the ice. They move the puck north to south, move the puck south to north very quickly. There's some similarities in their games.\"</p>\n<p>One of the great mysteries about adding Karlsson to the Penguins is how it'll impact Letang, in ice time and in effectiveness.</p>\n<p>Because this isn't the first time Karlsson has walked into a new dressing room to find a stall occupied by a franchise defenseman.</p>\n<hr>\n<p><strong><a href=\"https://www.espn.com/nhl/player/_/id/2300/brent-burns\">BRENT BURNS</a> WAS</strong> in his eighth season in San Jose when the Sharks traded for Karlsson in 2017.</p>\n<p>During their four seasons together in San Jose, there was a cottage industry of speculation about their relationship off the ice, to the point that Karlsson was asked about it three minutes into his introductory news conference in Pittsburgh.</p>\n<p>There was scrutiny over how they were deployed -- with whom they played and in what situations. There was a disparity in their power-play time, where Karlsson's average ice time was higher than Burns' in three of those four seasons as teammates.</p>\n<p>Burns was eventually traded to the <a href=\"http://www.espn.com/nhl/team/_/name/car/carolina-hurricanes\">Carolina Hurricanes</a> in 2022. Whether it was coincidence or not, Karlsson had his greatest offensive season in San Jose after Burns left.</p>\n<p><inline1></p>\n<p>\"I don't think we had a strained relationship. We became really good friends right away. Our personal friendship is something that I still cherish to this day, and we still stay in touch,\" Karlsson said of Burns. \"Unfortunately, we stopped winning games there, and that's when those questions come into play. I think the situation, and how it unfolded [in San Jose] is hopefully going to be a lot different than it will be here. But only time can tell.\"</p>\n<p>Sullivan has had to think about the presence of two alpha defensemen on the same roster and what he has to do to manage them.</p>\n<p>\"We're well aware of the experience that went on in San Jose,\" the coach said. \"We've been very proactive with discussions with both Erik and Kris about how we're going to try to utilize both of them and set them both up for success.\"</p>\n<p>The plan is to have one of Karlsson or Letang on the ice every time Crosby or Malkin is out there. Sullivan noted that power-play time was \"very important to star players\" and that Karlsson and Letang are no exception. The Penguins hoped to use both defensemen on the same power-play unit to start the season, but Sullivan said there would be other options if that configuration doesn't produce.</p>\n<p>Dubas, who took on the Penguins' general manager role along with being team president, said he's confident the Penguins will find the right mix for Karlsson on special teams.</p>\n<p>\"I don't have a whole lot of questions personally as to how Erik is going to fit on the power play with the group,\" Dubas said. \"Erik's the type of player who instinctually is going to make it fit and work. Everyone is not going to have to adjust to him. He's going to get the most out of others as he facilitates.\"</p>\n<p><video1></p>\n<p>There's another sense of déjà vu for Karlsson with this new team. Burns was part of an established core in San Jose that included Joe Thornton, <a href=\"http://www.espn.com/nhl/player/_/id/3451/joe-pavelski\">Joe Pavelski</a>, Patrick Marleau and <a href=\"http://www.espn.com/nhl/player/_/id/3773/logan-couture\">Logan Couture</a>. Karlsson finds a core in Pittsburgh that's equally entrenched.</p>\n<p>Sullivan said the challenge for him and the team is to make Karlsson feel as if he's part of the Penguins' foundation, rather than an add-on.</p>\n<p>\"As I said to Erik, this core has been established for a long time. We don't want Erik to come in and feel his way through,\" Sullivan said. \"We want him to become part of that core right away. We think his body of work's earned that.\"</p>\n<p>\"Sid and Geno and Tanger, they welcomed the addition of Erik on our team because they all have an insatiable appetite to win another Stanley Cup and they know adding him to our lineup makes us a much better hockey team,\" the coach said. \"But we'll continue to communicate with these guys. I'm sure there's going to be a feeling-out process and there'll be some bumps in the road, but we'll work through them.\"</p>\n<p>Karlsson said his experience with Burns showed that perceptions can be shaped by the standings.</p>\n<p>\"I think a lot of it's obviously going to rely on hockey, how well we do and how many games we win,\" he said. \"If that's the case, then you guys have nothing to write about and everything will be green on the other side of the fence.\"</p>\n<hr>\n<p><strong>SPEAKING OF PERCEPTIONS</strong>, does Erik Karlsson play defense?</p>\n<p>Because for the majority of his career, fairly or unfairly, the perception has been that he has neglected his defensive game in favor of his point totals.</p>\n<p>The NHL began tracking plus/minus in the 1959-60 season. Since that time, no defenseman has won the Norris Trophy with a worse rating than Karlsson's minus-26 in 2022-23. Despite his offensively dominant season -- his 101 points was the most by a defenseman since Brian Leetch in the 1991-92 season -- Karlsson received only 80.9% of the total vote points from the Professional Hockey Writers Association. Four voters didn't have Karlsson among their <em>top five</em> defensemen last season.</p>\n<p><a href=\"http://www.espn.com/nhl/player/_/id/4233884/mario-ferraro\">Mario Ferraro</a> played with Karlsson on the Sharks and always heard that knock on his game. \"I think it's false. I think how good his offense is makes him a very good defensive player,\" Ferraro said.</p>\n<p>He said Karlsson's ability to break the puck out of the zone and keep possession offensively is \"a part of playing defense\" in the NHL.</p>\n<p><inline2></p>\n<p>\"His skating ability is second to none. So it makes him have the ability to have good gaps in the offensive zone and in the neutral zone and chase down players and not let guys get wide on him,\" Ferraro said. \"So I actually think he's a very good defensive player because of how good he is offensively.\"</p>\n<p>Penguins forward <a href=\"http://www.espn.com/nhl/player/_/id/2563076/matt-nieto\">Matt Nieto</a>, who also played with Karlsson in San Jose, echoed that defense of Karlsson's defense.</p>\n<p>\"I honestly think his defense is very underrated. I mean, you really don't see him get beat a lot because of his skating ability,\" Nieto said. \"He's got a really good stick. But I think what sets him apart from most [defensemen] is that he's almost impossible to forecheck. He rarely spends time in his end.\"</p>\n<p>While Sullivan agreed that criticism of Karlsson's defense has been overstated, he does expect aspects of the Norris Trophy winner's game to improve now that he's with the Penguins and associate coach Todd Reirden, who works primarily with the team's defensemen.</p>\n<p>\"We've watched him a fair amount through the process when we were acquiring him,\" Sullivan said. \"And I think there are areas of his game where we can help him and challenge him to grow defensively.\"</p>\n<p>The Penguins coach said he had several conversations about Karlsson with his friend David Quinn, the coach of the Sharks. He said they're aligned on what Karlsson needs to do to improve his overall game.</p>\n<p>\"When you have a player like Erik that just commands the puck as much as it does when he's on the ice, you spend a whole lot less time defending. So there's an element of that part of his game,\" Sullivan said. \"But as far as his play away from the puck, I just don't subscribe to that narrative that he can't defend. I know he's very capable. We're going to challenge him to grow.\"</p>\n<hr>\n<p><strong>REFINING THE DEFENSIVE</strong> game of a 33-year-old Norris winner aside, the biggest challenge for Karlsson and the Penguins is prying their championship window wide enough to grab another Stanley Cup for the franchise -- and a first one for Karlsson.</p>\n<p>Although he has accomplished much in his career, Karlsson has never played for the Cup, let alone won it. He's been to the conference final twice, with Ottawa in 2017 and San Jose in 2019. Both times, the team that eliminated him -- Pittsburgh and St. Louis, respectively -- went on to lift the Cup.</p>\n<p><inline3></p>\n<p>Karlsson was wilting on the vine while the Sharks entered a rebuild. He loved living in the Bay Area. But he wanted to play for a contender again before it was too late.</p>\n<p>\"I've been pretty open about the whole situation, and that's exactly what it was. I'm not doing this for anything other than winning games and having a chance to compete for the Stanley Cup,\" Karlsson said. \"And as you get older, you start feeling that window is closing faster and faster. I think I'm at a point in my career now where I still have a lot of years left in me. Where I can be productive and be a leading part of a winning team. I felt like now was the best time for me to see if I could explore that, and I'm thankful that it worked out the way it did.\"</p>\n<p>Nieto believes that the change in scenery, and competitive goals, is going to be transformative for Karlsson.</p>\n<p>\"I think it's going to be huge for him,\" he said. \"We demand a lot out of each other in this group. We're not here just to try to make the playoffs. We're here to win the Cup.\"</p>\n<p><photo2></p>\n<p>Karlsson is not a cure-all for the Penguins:</p>\n<ul>\n<li>They're still a team that hasn't made it past the first round since 2017-18.</li>\n<li>They're still a team that can't hold a lead, as was evidenced by the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a>' comeback win on opening night. They were tied with the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a> last season with nine losses after leading into the second period. The Penguins had just a .585 winning percentage when scoring the game's first goal (22nd in the NHL).</li>\n<li>They're still a team that, even with an improved blue line, will succeed or fail on the play of the goaltenders. Dubas signed <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> to a five-year contract extension last summer. He has a career .914 save percentage and a 2.65 goals-against average in the regular season. In the postseason, those numbers dropped to .891 for the save percentage and 3.00 for the goals-against average.</li>\n</ul>\n<p>But Karlsson does make them better. Maybe even good enough to win Crosby, Malkin and Letang their fourth Stanley Cup. Maybe good enough where Karlsson can finally lift one himself.</p>\n<p>\"I've been in the league for 15 years. It's a long time. And every year I play for the same thing, just like the other 800 guys in this league do. I've come somewhat close a couple of times, but not close enough to be able to really have a chance at it,\" Karlsson said. \"I don't think there's a better place to try and accomplish that than with this group in Pittsburgh.\"</p>\n\n\n\n\n",
  "<p><video1></p>\n<p>The second game of the NHL's season-opening slate will bear a familiar storyline of an idol turning into a rival.</p>\n<p><a href=\"http://www.espn.com/nhl/player/_/id/5149125/connor-bedard\">Connor Bedard</a>, the No. 1 pick in this year's NHL draft, makes his start for the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a> against his favorite player, <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> center <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>.<br>\n<br>\n<alsosee></p>\n<p>The 18-year-old forward was born less than two weeks before Crosby was selected first overall by Pittsburgh in the 2005 NHL draft. The two met at the NHL player media tour in September.</p>\n<p>\"Of course, my childhood idol in the hockey world and [Crosby] is such a good, genuine guy,\" Bedard told NHL.com. \"For me to kind of spend some time with him and learn about him. ... Just his playmaking and the way he controls the game in the offensive zone is pretty incredible. Just his complete game. He's such a 200-foot player, so you can learn a lot from him.\"</p>\n<p>The veteran center offered support for Bedard ahead of his NHL debut.</p>\n<p>\"I think he's a really good player. He's going to get a really good opportunity there to be one of the guys, if not the guy,\" Crosby said.</p>\n<p>Bedard joins a list of players to face off against a beloved superstar early in his career.</p>\n\n\n<h2>Allen Iverson</h2>\n<video2>\n<p>In his rookie season with the <a href=\"https://www.espn.com/nba/team/_/name/phi/philadelphia-76ers\">Philadelphia 76ers</a>, Iverson faced a big assignment of facing the <a href=\"https://www.espn.com/nba/team/_/name/chi/chicago-bulls\">Chicago Bulls</a> and namely the GOAT: <a href=\"https://www.espn.com/nfl/player/_/id/4040622/michael-jordan\">Michael Jordan</a>.</p>\n\n\n<p>Iverson took advantage of the moment and shook up MJ with his signature crossover.</p>\n<p>\"All I could think about is I had no fear,\" Iverson told NBA.com. \"I feared so many other things off the court, but nothing on the court. [That crossover] was indicative of how I felt as far as being fearless on the court. We was at war. I looked at him as anybody else being in front of me. Coming into the league, I knew if I had the opportunity of trying my move that I was going to do it, and not be fearful of it.\"</p>\n\n\n\n<h2>Kobe Bryant</h2>\n\n\n<p><video3></p>\n<p>Throughout his career and in retirement, Bryant was vocal of how Jordan inspired his game. Like Iverson, he faced Jordan as a rookie with the <a href=\"https://www.espn.com/nba/team/_/name/lal/los-angeles-lakers\">Los Angeles Lakers</a> and it was a memorable experience</p>\n<p>During an episode of the \"Holding the Court with Geno Auriemma\" podcast, Bryant recalled his first time facing Jordan to the <a href=\"http://www.espn.com/womens-college-basketball/team/_/id/41/uconn-huskies\">UConn Huskies</a> women's basketball coach.</p>\n<p>\"I was thinking in my mind, I didn't care. I'm going to destroy this guy. I don't care if I'm 18, I'm coming for blood. And the first thing he did, they ran a fifth-down sequence in the triangle. He caught the ball in the corner and he made his little pirouette spin that he does and sneaks baseline. I fell for it, and he went by me and dunked it. I remember just laughing to myself all the way up the court. I've seen that move thousands of times and I can't believe I just fell for it. And then after that, it was like, 'OK, let's get to work.' Every time I faced him I wanted to see how he was going to respond to his same moves. The best way I could figure out how to defend him was to see how he would defend himself if I hold a mirror up.\"</p>\n<p><inline></inline></p>\n\n\n<h2><a href=\"https://www.espn.com/mlb/player/_/id/31606/xander-bogaerts\">Xander Bogaerts</a></h2>\n<p>At 21 years old, Bogaerts was the <a href=\"https://www.espn.com/mlb/team/_/name/bos/boston-red-sox\">Boston Red Sox</a>'s youngest Opening Day shortstop in 100 years when he played his idol, longtime <a href=\"https://www.espn.com/mlb/team/_/name/nyy/new-york-yankees\">New York Yankees</a> shortstop Derek Jeter. Bogaerts donned No. 2 in honor of Jeter and shared what it was like to play against his idol in 2014.</p>\n\n\n<p>\"Growing up, he was my favorite player. I mean, he's just a good person, on and off the field. He came up big-time in big situations for the Yankees, all those World Series. What do I appreciate about him most? Everything,\" Bogaerts said. \"He's never been in trouble for anything, just a clean man. You don't hear too much about him off the field.\"</p>\n\n\n<h2><a href=\"https://www.espn.com/mlb/player/_/id/32653/carlos-correa\">Carlos Correa</a></h2>\n\n\n<p>Correa took advantage of a second-inning delay between the <a href=\"https://www.espn.com/mlb/team/_/name/hou/houston-astros\">Houston Astros</a> and <a href=\"https://www.espn.com/mlb/team/_/name/laa/los-angeles-angels\">Los Angeles Angels</a> for an umpire play review to meet a childhood hero of his, Albert Pujols.</p>\n<p>\"He's a guy I admired, a guy I looked up to when I was growing up,\" Correa said, per MLB.com. \"He's obviously a great player and one of the greatest hitters in the game. It's good to talk to guys like that who have knowledge of the game and can help you with some stuff.\"</p>\n<p><inline2></p>\n<h2>Floyd Mayweather Jr.</h2>\n\n\n<p>Mayweather's first title fight was against Genaro Hernandez in 1998. At the time, the 21-year-old was ranked No. 8 after racking up the first 17 consecutive wins of his perfect 50-0 professional boxing record.</p>\n<p>During an Instagram live with rapper Fat Joe in 2020, he reflected on the first title fight of his career that happened to be against his idol.</p>\n<p>\"When I was 16, I had a poster on my wall, because you remember, when we were young, we used to have posters on our wall. Young kids don't do that anymore,\" Mayweather said. \"I had a poster, right above my head, Genaro 'Chicanito' Hernandez. And I used to watch him on TV fight and I said nobody will beat that guy. I was 16. Five years later I was across from that guy, fighting for the championship.\"</p>\n\n\n<h2><a href=\"https://www.espn.com/nfl/player/_/id/4361741/brock-purdy\">Brock Purdy</a></h2>\n\n\n<p>The <a href=\"https://www.espn.com/nfl/team/_/name/sf/san-francisco-49ers\">San Francisco 49ers</a> quarterback's first start was a memorable one as he faced then-<a href=\"https://www.espn.com/nfl/team/_/name/tb/tampa-bay-buccaneers\">Tampa Bay Buccaneers</a> quarterback Tom Brady. Purdy accounted for three touchdowns and looked far from \"Mr. Irrelevant\" in the 49ers' <a href=\"https://www.espn.com/nfl/game/_/gameId/401437897\">35-7</a> blowout victory.</p>\n<p>After the game he shared his thoughts while on the opposing sideline of the seven-time Super Bowl winner.</p>\n<p>\"It was surreal just standing there like, man, that's Tom Brady, you know, talking to guys and dapping guys up and stuff. So, for him to have respect for what I did today was pretty cool. I'm not going to lie,\" Purdy said. \"Being a little kid, watching that guy kill it throughout all these years, win Super Bowls and then to be able to just even give him a high five or whatever at the end, I thought that was pretty cool.\"</p>\n\n\n<p><inline1></p>\n\n\n\n\n\n",
  "<p><video1></p>\n<p>Ahead of <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>'s rookie debut in 2005, he felt the weight of the NHL on his shoulders. The league was coming off a yearlong lockout. The team that drafted him No. 1, the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a>, was in such peril that it was exploring relocation. The hype surrounding the 18-year-old Crosby was insane; he was already a hockey icon before stepping on NHL ice.</p>\n<p>Crosby returned home from his first NHL morning skate and did something he rarely does: He botched his pregame nap.</p>\n<p>\"I didn't sleep at all,\" Crosby said in an interview last month at the NHL media tour in Las Vegas. \"It's just like, you're almost there, and you're so excited, anxious, nervous. There's all these different emotions you're feeling. Nothing can prepare you for that. You have no idea what to expect. The [media] scrums, the buildup and all the stuff leading up to it, and you still haven't played a game. So you almost felt like you shouldn't be talking about it because you haven't played yet. And knowing your family's going to be there, and everything that led up to playing your first game, you have all these snapshots going through your mind.\"</p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.espn.com/nhl/story/_/id/38278359/2023-24-nhl-schedule-espn-tv-listings-games-matchups\">How to watch the NHL on ESPN, ABC, ESPN+ and Hulu</a></strong></p>\n\n\n<p><alsosee></p>\n<p>Game 1 didn't go as Crosby imagined. The Devils won 5-1. Crosby assisted on the lone Pittsburgh goal, the first of 102 points in his rookie season -- which kick-started a career that somehow exceeded expectations. Now, at 36 -- with three Stanley Cups and two Hart Trophies and on the cusp of breaking into the NHL's top 10 scoring list -- he's able to reminisce.</p>\n<p>\"Trying to manage all that, you're young, and you haven't gone through stuff like that,\" Crosby said. \"Looking back at it, I look at it as a fun experience. It wasn't something that was bad. It's just very unique.\"</p>\n\n\n<hr>\n\n\n<p><video2></p>\n<p><strong>CROSBY'S 19th SEASON</strong> in the league will begin with the same level of fanfare -- for his opponent. The Penguins open on Tuesday (<a href=\"https://www.espn.com/nhl/game?gameId=401559237\">8 p.m. ET, ESPN/ESPN+</a>) against the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a>, featuring No. 1 pick <a href=\"http://www.espn.com/nhl/player/_/id/5149125/connor-bedard\">Connor Bedard</a>, anointed as the next face of the league. Sid the Kid aged into a role where he now plays against the kids who grew up idolizing him.</p>\n<p>Crosby feels comfortable enough in himself to take on the role of mentor. In Las Vegas, Crosby agreed to do the first portion of media interviews alongside Bedard -- dispensing some insight, while also allowing the teenager to learn from example.</p>\n<p><inline1></p>\n<p>Crosby had two pieces of advice: Try to enjoy the experience. And learn when to say no.</p>\n<p>\"The new stuff is what comes off the ice, whether it's media or just commitments that come with that. And I think he'll figure it out, but it's hard to say no early on. You're trying to balance so much, and at some point, you might get tired, or it might be taking away from things,\" Crosby said. \"There's going to be a lot of demands off the ice. There's high enough expectations when it comes to on the ice.\"</p>\n<p>It's already been eye-opening to Bedard, who -- before he even got to training camp -- told ESPN: \"I mean, I'd be so sick of myself if I was a fan. I think there's been so much stuff on me.\"</p>\n<p>But the rookie is taking notes from Crosby on how to handle the extra attention.</p>\n<p>\"He talks to everyone he passes by and takes his time with everyone,\" Bedard said. \"He's the pinnacle of that, of carrying himself. Of course, on the ice everyone knows how great he is. But I think off the ice and how he handles things there is just as special.</p>\n<p>\"I mean, of course I want to ask him a lot of questions. But you don't want to be too annoying. And [so I asked him] just kinda some simple stuff about the league. Nothing really that wild.\"</p>\n<p>Aspects of Bedard's game impress Crosby, beginning with the teenager's shot. Crosby also noted the Blackhawks rookie's competitiveness. \"You can see when the stakes are high,\" Crosby said. \"He's always raised his game.\"</p>\n<p>Crosby kept his advice strictly off-ice. Because if there's one thing you need to know about Crosby in this iteration: He's never been hungrier to win.</p>\n\n\n\n<hr>\n\n\n<p><strong>THE PENGUINS MISSED</strong> the <a href=\"https://www.espn.com/nhl/story/_/id/36173736/islanders-claim-final-playoff-spot-penguins-16-year-streak-ends\">playoffs last season for the first time in 17 years</a>, and it absolutely grated at Crosby. Those close to the Penguins captain said he never talked about the silver lining of having a long summer and more time for recovery. It was only about finding ways to improve.</p>\n<p><inline2></p>\n<p>\"When it comes to a lot of different skills, that's just constantly learning,\" Crosby said. \"Things that you do well one year maybe don't come as easy the next year for whatever reason, whether it's you or just the way things have kind of happened. So, identifying those things, not being too hard on yourself when things don't go well, knowing that's the process. It's a long season. And that just comes with experience.\"</p>\n<p>As with the advice he gave Bedard, Crosby has figured out over the years what works for him. The NHL's annual player media tour was in part created because of Crosby. He wanted to do less off-ice stuff during camp, so the league and Crosby's camp brainstormed a one-stop event to be more economical with his time.</p>\n<p>It was a collaboration between the league and Crosby's camp, and the star Crosby has attended the event for 16 consecutive Septembers, whereas it's not uncommon for other star players to pass in any given year.</p>\n<p>For several years, Crosby also held an invitation-only end-of-offseason training camp for a handful of players in Vail. Crosby loved the ramp-up in Colorado, where he could test himself at altitude. Although Crosby now attends BioSteel Camp instead, because that's where his longtime trainer Andy O'Brien is, he's considering reviving the Vail camp in the future.</p>\n<p>Since his rookie season, Crosby has been nothing but consistent. He's been a point-per-game player in every season of his 18-year career. His faceoff percentage over his first two seasons (51.36%) is nearly identical to that of the past two seasons (52.73%). And last season Crosby took more faceoffs than any other player in the NHL.</p>\n<p><inline3></p>\n<p>In some ways he's getting better with age. Crosby scored more game-winning goals over the past two seasons (18) than in any other two-year span in his career.</p>\n<p>But Crosby has also been forced to adapt, as he has lost some of his quickness with age. Over the past several years, Crosby has relied more on his hockey IQ -- finding the \"quiet spaces\" of where the puck is going to be. But he doesn't cheat for his offense. Instead, Crosby has focused on becoming even more defensively responsible. The center got his first top-five Selke Trophy finish in his age-31 season.</p>\n<p>Crosby has two seasons remaining on his contract. Those close to Crosby say that although he is curious about many things, he never talks beyond vague terms of what he'd like to do when he retires. He's too dialed in on what's right in front of him.</p>\n<p>\"I think when you stop having fun, it's probably time,\" Crosby said. \"So, I'm still having fun, and there's different challenges, different motivations. When that spark isn't there, that fire isn't burning, then it's probably time to put 'em away.\"</p>\n<p>One thing Crosby is sure of: how he'd like to be remembered.</p>\n<p>\"Just that I competed hard, that I was a good teammate, dependable every night, someone that didn't take it for granted,\" Crosby said. \"And I think you want to be known as a winner. Someone that, when stakes were high, you showed up and were at your best.\"</p>\n\n\n\n\n",
  "<p><video1></p>\n<p><a href=\"https://www.espn.com/nfl/player/_/id/3915511/joe-burrow\">Joe Burrow</a> is getting <i>paid</i>.</p>\n<p><alsosee></p>\n<p>The <a href=\"https://www.espn.com/nfl/team/_/name/cin/cincinnati-bengals\">Cincinnati Bengals</a> quarterback signed a <a href=\"https://www.espn.com/nfl/story/_/id/38348975/qb-joe-burrow-agrees-record-five-year-275m-extension-bengals-sources-say\">five-year, $275 million extension</a> Thursday, making him the highest-paid player in NFL history.</p>\n<p>Burrow has turned the Bengals' fortunes around since joining the franchise in 2020. He led the team to a Super Bowl berth in the 2021-22 season and an AFC championship appearance in 2022-23. Though his career is still young, Burrow's career completion percentage of 68.2% is the highest ever among NFL QBs.</p>\n<p>Burrow's deal, while big, is still more than $150 million short of the active \"Big Four\" American sports record -- an honor held by the <a href=\"https://www.espn.com/mlb/team/_/name/laa/los-angeles-angels\">Los Angeles Angels</a>' <a href=\"https://www.espn.com/mlb/player/_/id/30836/mike-trout\">Mike Trout</a>. Here's how the contract stacks up with others throughout sports.</p>\n\n\n\n<h2>MLB</h2>\n<p><photo3></p>\n<p><b><a href=\"https://www.espn.com/mlb/player/_/id/30836/mike-trout\">Mike Trout</a>, <a href=\"https://www.espn.com/mlb/team/_/name/laa/los-angeles-angels\">Los Angeles Angels</a>: 12 years, $426.5 million</b></p>\n<p><b>Year signed:</b> 2019</p>\n<p>Trout has been either the best player in baseball or close to it for the better part of a decade, and the Angels rewarded him accordingly. At the time he signed this deal, it was the richest contract in professional American sports. Though he's been hampered by injuries, he's played 423 games and won the 2019 MVP since the signing.</p>\n\n\n<p><b><a href=\"https://www.espn.com/mlb/player/_/id/33039/mookie-betts\">Mookie Betts</a>, <a href=\"https://www.espn.com/mlb/team/_/name/lad/los-angeles-dodgers\">Los Angeles Dodgers</a>: 12 years, $365 million</b></p>\n<p><b>Year signed:</b> 2021</p>\n<p>The Dodgers secured Betts until the 2030s shortly after acquiring him in a trade from the Boston Red Sox. He's had two top-five MVP finishes and a World Series win since then.</p>\n\n\n<p><b><a href=\"https://www.espn.com/mlb/player/_/id/33192/aaron-judge\">Aaron Judge</a>, <a href=\"https://www.espn.com/mlb/team/_/name/nyy/new-york-yankees\">New York Yankees</a>: 9 years, $360 million</b></p>\n<p><b>Year signed:</b> 2022</p>\n<p>The Yankees ensured their 6-foot-7 MVP slugger remained in pinstripes after he mashed an American League-record 62 homers while hitting .311/.425/.686 with an AL-leading 131 RBIs in 2022.</p>\n<p><b><a href=\"https://www.espn.com/mlb/player/_/id/32129/francisco-lindor\">Francisco Lindor</a>, <a href=\"https://www.espn.com/mlb/team/_/name/nym/new-york-mets\">New York Mets</a>: 10 years, $341 million</b></p>\n<p><b>Year signed:</b> 2021</p>\n<p>The Mets signed Lindor to this monster deal shortly before Opening Day 2021, and though he had a disappointing performance that season, he rebounded nicely in 2022 as the team won 101 games. Lindor hit a home run in the postseason, but the Mets fell to the Padres 2-1 in their National League wild-card series.</p>\n\n\n<p><b><a href=\"https://www.espn.com/mlb/player/_/id/35983/fernando-tatis-jr\">Fernando Tatis Jr.</a>, <a href=\"https://www.espn.com/mlb/team/_/name/sd/san-diego-padres\">San Diego Padres</a>: 14 years, $340 million</b></p>\n<p><b>Year signed:</b> 2021</p>\n<p>Tatis had a huge season after signing his contract, hitting a league-leading 42 home runs and putting up 6.6 WAR in 2021. Injuries and a suspension for performance-enhancing drugs caused him to miss the entirety of the 2022 campaign, however.</p>\n\n\n\n<h2>NFL (by practical guaranteed money)</h2>\n<p><photo1></p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/3915511/joe-burrow\">Joe Burrow</a>, <a href=\"https://www.espn.com/nfl/team/_/name/cin/cincinnati-bengals\">Cincinnati Bengals</a>: 5 years, $275 million (79.6% of total contract)</b></p>\n<p><b>Year signed: 2023</b></p>\n<p>Burrow led the Bengals to a 12-4 record in 2022-23. He threw for 35 touchdowns to go with 12 interceptions, passed for 4475 yards and completed 68.3% of his passes along the way. His contract has $219 million guaranteed.</p>\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/4040605/nick-bosa\">Nick Bosa</a>, <a href=\"https://www.espn.com/nfl/team/_/name/sf/san-francisco-49ers\">San Francisco 49ers</a>: 5 years, $170 million (72.1% of total contract)</b></p>\n<p><b>Year signed:</b> 2023</p>\n<p>Bosa earned the Defensive Player of the Year award, his first All-Pro selection and third Pro Bowl berth by posting a league-leading 18.5 sacks, 51 tackles, two forced fumbles and 58 quarterback pressures (third in the NFL) the season prior to signing his big deal.</p>\n<p><a href=\"https://www.espn.com/nfl/story/_/id/38340390/source-49ers-nick-bosa-highest-paid-defensive-player\"><b>Read more: Source: 49ers, Bosa reach 5-yr., $170M extension</b></a></p>\n<p>His contract includes 122.5 million guaranteed, making him the highest-paid non-quarterback in NFL history. His brother, <a href=\"https://www.espn.com/nfl/player/_/id/3051389/joey-bosa\">Joey Bosa</a>, holds the No.2 spot among highest paid defenders (by total guaranteed money) with a $102 million contract.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/4038941/justin-herbert\">Justin Herbert</a>, <a href=\"https://www.espn.com/nfl/team/_/name/lac/los-angeles-chargers\">Los Angeles Chargers</a>: 5 years, $262.5 million (83.3% </b><strong>of total contract)</strong></p>\n<p><b>Year signed:</b> 2023</p>\n<p>Herbert was selected with the sixth overall pick in 2020, and in the 2022 season, he led the Chargers to their first playoff appearance in four years.</p>\n<p><a href=\"https://www.espn.com/mlb/story/_/id/38068747/sources-chargers-qb-justin-herbert-agree-5-year-262m-extension\"><strong>Read more:</strong> Chargers, Justin Herbert agree to 5-year, $262.5M deal</a></p>\n<p>His 14,089 passing yards and 1,316 career passes are the most through a quarterback's first three NFL seasons. He was slated to play on the fourth year of his rookie deal for $4.23 million. Instead, his average annual salary jumped up to $52.5 million, the highest in NFL history. </p>\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/3916387/lamar-jackson\">Lamar Jackson</a>, <a href=\"https://www.espn.com/nfl/team/_/name/bal/baltimore-ravens\">Baltimore Ravens</a>: 5 years, $260 million (71.1% of total contract)</b></p>\n<p><b>Year signed:</b> 2023</p>\n<p>Jackson was the second unanimous selection as NFL MVP in his first full season. He represented himself in contract negotiations, which went on for 27 months.</p>\n<p><a href=\"https://www.espn.com/nfl/story/_/id/36305705/sources-lamar-jackson-ravens-progressing-extension-talks\"><strong>Read more:</strong> Jackson's new Ravens deal includes $185M guaranteed</a></p>\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/4040715/jalen-hurts\">Jalen Hurts</a>, <a href=\"https://www.espn.com/nfl/team/_/name/phi/philadelphia-eagles\">Philadelphia Eagles</a>: 5 years, $255 million (70.3% of total contract)</b></p>\n<p><b>Year signed:</b> 2023</p>\n<p>Hurts, who led the Eagles to a Super Bowl LVII berth, threw for 3,701 yards with 22 touchdowns and rushed for 760 yards and 13 scores.</p>\n<p>He was lined up to play the final year of his rookie deal, which included a base salary of $4.2 million. His extension, which includes the first no-trade clause in franchise history, will be about $51 million per year.</p>\n<p><a href=\"https://www.espn.com/nfl/story/_/id/36215602/jalen-hurts-eagles-255-million-contract-means\"><strong>Read more:</strong> Numbers to know from Jalen Hurts' record $255M extension</a></p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/3122840/deshaun-watson\">Deshaun Watson</a>, <a href=\"https://www.espn.com/nfl/team/_/name/cle/cleveland-browns\">Cleveland Browns</a>: 5 years, $230 million (100% of total contract)</b></p>\n<p><b>Year signed:</b> 2022</p>\n<p>Watson's contract is one of the largest in NFL history, but his tenure with the Browns has been marred by an 11-game suspension for violating the NFL's personal conduct policy by committing sexual assault, as defined by the league. He threw for 7 touchdowns against 5 interceptions in six 2022 starts.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/3917315/kyler-murray\">Kyler Murray</a>, <a href=\"https://www.espn.com/nfl/team/_/name/ari/arizona-cardinals\">Arizona Cardinals</a>: 5 years, $189.5 million (82.2% of total contract)</b></p>\n<p><b>Year signed:</b> 2022</p>\n<p>While Murray played well in the first year of his big extension, throwing for 2,368 yards at a 66.4% completion rate and tossing 14 touchdowns and seven interceptions, the Cardinals went 4-13 in 2022 -- with Murray's season ending early due to injury.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/14881/russell-wilson\">Russell Wilson</a>, <a href=\"https://www.espn.com/nfl/team/_/name/den/denver-broncos\">Denver Broncos</a>: 5 years, $161 million (66.4% of total contract)</b></p>\n<p><b>Year signed:</b> 2022</p>\n<p>This might go down as one of the worst trades and contracts in NFL history if the first year of Wilson's deal is any indicator. He barely completing 60% of his passes and threw just 16 touchdowns as the Broncos missed the playoffs.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/8439/aaron-rodgers\">Aaron Rodgers</a>, <a href=\"https://www.espn.com/nfl/team/_/name/gb/green-bay-packers\">Green Bay Packers</a>: 3 years, $150.8 million (100% of total contract)</b></p>\n<p><b>Year signed:</b> 2022</p>\n<p>Rodgers' deal makes him one of the highest paid athletes in the world on an annual basis. The star quarterback now plies his trade in New York though, as the Jets traded for him following a lackluster season from the Packers.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nfl/player/_/id/3918298/josh-allen\">Josh Allen</a>, <a href=\"https://www.espn.com/nfl/team/_/name/buf/buffalo-bills\">Buffalo Bills</a>: 6 years, $150 million (58.1% of total contract)</b></p>\n<p><b>Year signed:</b> 2021</p>\n<p>The Bills haven't had a young quarterback like Allen in a very, very long time. He's thrown for 9306 yards and 74 touchdowns over the past two years, with 1525 yards and 14 touchdowns on the ground to go along with that.</p>\n\n\n<h2>NBA</h2>\n<p><photo2></p>\n\n\n<p><strong><a href=\"https://www.espn.com/nba/player/_/id/3917376/jaylen-brown\">Jaylen Brown</a>, <a href=\"https://www.espn.com/nba/team/_/name/bos/boston-celtics\">Boston Celtics</a>: 5 years, $304 million</strong></p>\n<p><strong>Year signed: 2023</strong></p>\n<p>Brown averaged 26.6 points per game last season and alongside <a href=\"https://www.espn.com/nba/player/_/id/4065648/jayson-tatum\">Jayson Tatum</a> has helped lead the Celtics to three of the last four Eastern Conference Finals.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nba/player/_/id/3112335/nikola-jokic\">Nikola Jokic</a>, <a href=\"https://www.espn.com/nba/team/_/name/den/denver-nuggets\">Denver Nuggets</a>: 5 years, $272 million</b></p>\n<p><b>Year signed: 2022</b></p>\n<p>The reigning NBA Finals MVP, Jokic signed a max extension with the Nuggets in 2022 that, until Brown's deal, was the largest contract in NBA history.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nba/player/_/id/6580/bradley-beal\">Bradley Beal</a>, <a href=\"https://www.espn.com/nba/team/_/name/wsh/washington-wizards\">Washington Wizards</a>: 5 years, $251 million</b></p>\n<p><b>Year signed: 2022</b></p>\n<p>After declining an option to become a free agent in 2022, Beal signed a max contract to remain with the Wizards for the next five seasons. His time in Washington under the extension proved short-lived, however, as he was dealt to the <a href=\"https://www.espn.com/nba/team/_/name/phx/phoenix-suns\">Phoenix Suns</a> this offseason.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nba/player/_/id/3032977/giannis-antetokounmpo\">Giannis Antetokounmpo</a>, <a href=\"https://www.espn.com/nba/team/_/name/mil/milwaukee-bucks\">Milwaukee Bucks</a>: 5 years, $228.2 million</b></p>\n<p><b>Year signed: 2021</b></p>\n<p>At the time, this was the largest contract in NBA history, but it was well worth it for the Bucks. Antetokounmpo led them to a title and was named Finals MVP in 2020-21. He's only gotten better since then and averaged over 30 points per game for the first time ever last season.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nba/player/_/id/3136193/devin-booker\">Devin Booker</a>, <a href=\"https://www.espn.com/nba/team/_/name/phx/phoenix-suns\">Phoenix Suns</a>: 4 years, $224 million</b></p>\n<p><b>Year signed: 2022</b></p>\n<p>This season, Booker led the Suns to a franchise-record 18-game winning streak, finished at 64-18 and overcame an injury to lead the team to the Western Conference semifinals before losing to the Mavericks in seven games.</p>\n\n\n<p><b><a href=\"https://www.espn.com/nba/player/_/id/3136195/karl-anthony-towns\">Karl-Anthony Towns</a>, <a href=\"https://www.espn.com/nba/team/_/name/min/minnesota-timberwolves\">Minnesota Timberwolves</a>: 4 years, $224 million</b></p>\n<p><b>Year signed: 2022</b></p>\n<p>Towns scored a Timberwolves-record 60 points last season while leading the team to their first playoff appearance in four seasons.</p>\n\n\n\n<h2><b> </b>NHL</h2>\n\n\n<p><photo5></p>\n<p><strong><a href=\"https://www.espn.com/nhl/player/_/id/2278/shea-weber\">Shea Weber</a>, <a href=\"http://www.espn.com/nhl/team/_/name/nsh/nashville-predators\">Nashville Predators</a>: 14 years, $110 million</strong></p>\n<p><b>Year signed:</b> 2012</p>\n<p>This is a bit of an odd situation -- despite a distinguished career and five years remaining on his lengthy contract, Weber has been plagued by injuries and hasn't played since the 2020-21 season. It's quite possible that he'll never play in the NHL again.</p>\n\n\n<p><b><a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a>: 12 years, $104.4 million</b></p>\n<p><b>Year signed:</b> 2013</p>\n<p>Sid the Kid won't be a free agent until his age-38 season, but he's still producing for the Penguins. He was 10th in the league in points in 2021-22 and ended 2022-23 in 16th.</p>\n\n\n<p><b><a href=\"http://www.espn.com/nhl/player/_/id/3895074/connor-mcdavid\">Connor McDavid</a>, <a href=\"http://www.espn.com/nhl/team/_/name/edm/edmonton-oilers\">Edmonton Oilers</a>: 8</b><b> years, $100 million</b></p>\n<p><b>Year signed:</b> 2018</p>\n<p>McDavid hasn't led the Oilers to a Stanley Cup win yet, but he's one of just two players to unanimously win the Hart Memorial Trophy, doing so in 2021. The other unanimous winner? Wayne Gretzky.</p>\n\n\n<p><b><a href=\"http://www.espn.com/nhl/player/_/id/5164/erik-karlsson\">Erik Karlsson</a>, <a href=\"http://www.espn.com/nhl/team/_/name/sj/san-jose-sharks\">San Jose Sharks</a>: 8 years, $92 million</b></p>\n<p><b>Year signed:</b> 2019</p>\n<p>One of the best defensemen in the league and a two-time Norris Trophy winner, Karlsson scored the first hat trick of his distinguished career in 2022.</p>\n\n\n<p><b><a href=\"http://www.espn.com/nhl/player/_/id/3995/drew-doughty\">Drew Doughty</a>, <a href=\"http://www.espn.com/nhl/team/_/name/la/los-angeles-kings\">Los Angeles Kings</a>: 8 years, $88 million</b></p>\n<p><b>Year signed:</b> 2019</p>\n<p>A Norris Trophy winner, Doughty unfortunately missed most of the 2021-22 season with a wrist injury. Fortunately for the Kings, he returned for 2022-23 and picked up right where he left off.</p>\n\n\n\n\n",
  "<p>CHICAGO -- <a href=\"http://www.espn.com/nhl/player/_/id/5149125/connor-bedard\">Connor Bedard</a> heard from a lot of people after he was selected by the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a> with the No. 1 overall pick in the NHL draft.</p>\n<p>There was one in particular who stood out.</p>\n<p>\"I got a text from <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, so that was really cool,\" Bedard said. \"My favorite player growing up and obviously one of the best to ever do it, so I was pretty excited there.\"</p>\n<p>If everything goes according to plan for Bedard and the Blackhawks, the teenager will make his NHL debut against Crosby and the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> on Oct. 10. The road to the opener for Bedard begins with the team's development camp that starts this weekend.</p>\n<p>The high-scoring forward made it clear Friday that he isn't looking too far ahead.</p>\n<p>\"This is a big summer for myself to try to make the team and play in the league, of course,\" Bedard said. \"Obviously, it's very fast. Everyone is bigger, stronger.\"</p>\n<p>Bedard, who turns 18 on July 17, is the crown jewel of an 11-man draft class for Chicago that also includes <a href=\"http://www.espn.com/nhl/player/_/id/5149194/oliver-moore\">Oliver Moore</a>, another first-rounder known for his speed. Moore is slated to play college hockey for Minnesota.</p>\n<p>Bedard is the second No. 1 overall pick in franchise history, joining <a href=\"http://www.espn.com/nhl/player/_/id/3735/patrick-kane\">Patrick Kane</a> in 2007. Kane helped the Blackhawks win the Stanley Cup in 2010, 2013 and 2015.</p>\n<p>\"Obviously, you know the history of this organization and the expectation of winning,\" Bedard said while sitting beside Moore at a table with four more of the team's draft picks. \"We're going to do everything we possibly can to improve ourselves and try to win games and ultimately win a Stanley Cup. That's the main goal.\"</p>\n<p>Widely regarded as a generational talent, compared to his idol Crosby and Edmonton star <a href=\"http://www.espn.com/nhl/player/_/id/3895074/connor-mcdavid\">Connor McDavid</a>, the 5-foot-10 Bedard had 71 goals and 72 assists in 57 games for Regina in the WHL last season. He also was the tournament MVP when Canada won the world junior hockey championship in January.</p>\n<p>While Bedard continues his preparation for his first NHL season, the Blackhawks are adding some veteran forwards to help with his transition.</p>\n<p>Chicago announced Friday that it had agreed to a $4 million, one-year contract with <a href=\"http://www.espn.com/nhl/player/_/id/2273/corey-perry\">Corey Perry</a>, who had 12 goals and 13 assists in 81 games for Tampa Bay last season.</p>\n<p>The Blackhawks traded a seventh-round pick to the Lightning for the 38-year-old Perry on Thursday. He was eligible to become an unrestricted free agent on Saturday.</p>\n<p>Chicago, which finished with a 26-49-7 record last season, also acquired forwards <a href=\"http://www.espn.com/nhl/player/_/id/5428/taylor-hall\">Taylor Hall</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3535/nick-foligno\">Nick Foligno</a> <a href=\"https://apnews.com/article/bruins-blackhawks-nhl-trade-taylor-hall-0052014a77bc6f80814a1b2d2276af16\">in a trade with Boston</a> on Monday. It announced a $4 million, one-year contract with the 35-year-old Foligno on Tuesday.</p>\n<p>Perry is joining his fifth NHL team. He has 417 goals and 466 assists in 1,257 career regular-season games.</p>\n<p>Perry also leads active players with 196 career postseason appearances. He won the 2007 Stanley Cup with Anaheim.</p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/team/_/name/wsh/washington-capitals\">Washington Capitals</a> star <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> had the top-selling NHL jersey during his record-breaking 2022-23 season, according to Fanatics.</p>\n<p>As he continued his pursuit of Wayne Gretzky's career NHL goals record of 894, Ovechkin set records for the most goals with one franchise, most career goals scored on the road and most 40-goal seasons. On Dec. 23, 2022, Ovechkin passed Gordie Howe for second on the goal-scoring list behind Gretzky, finishing the season with 822 career goals.</p>\n<p><inline1></p>\n<p>This was the second straight season that Ovechkin led the NHL in jersey sales.</p>\n<p>While Ovechkin jerseys have ranked highly in sales throughout his career, the Capitals also had two new designs this season: their Reverse Retro sweaters with a blue, black and bronze color scheme and their white Stadium Series sweaters created for their game at NC State. Ovechkin didn't play in that game due to the death of his father, but his jersey was available.</p>\n<p><a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> of the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> was second among NHL players in jersey sales, and <a href=\"http://www.espn.com/nhl/team/_/name/bos/boston-bruins\">Boston Bruins</a> star <a href=\"http://www.espn.com/nhl/player/_/id/3114778/david-pastrnak\">David Pastrnak</a> was third. Their teams met in the Winter Classic at Fenway Park this season, featuring two new jersey designs for sale.</p>\n<p><a href=\"http://www.espn.com/nhl/team/_/name/nj/new-jersey-devils\">New Jersey Devils</a> star <a href=\"http://www.espn.com/nhl/player/_/id/4565222/jack-hughes\">Jack Hughes</a> had a surge in jersey sales this season to join the top five in fourth place as his team made the playoffs for the first time since 2018. <a href=\"http://www.espn.com/nhl/player/_/id/4024123/auston-matthews\">Auston Matthews</a> of the <a href=\"http://www.espn.com/nhl/team/_/name/tor/toronto-maple-leafs\">Toronto Maple Leafs</a> was fifth.</p>\n<p>The Maple Leafs won a playoff series for the first time since 2004, which helped give Matthews the highest-selling jersey in the first round of the postseason, according to Fanatics. Hughes was second and <a href=\"http://www.espn.com/nhl/player/_/id/3041969/nathan-mackinnon\">Nathan MacKinnon</a> of the <a href=\"http://www.espn.com/nhl/team/_/name/col/colorado-avalanche\">Colorado Avalanche</a> was third, followed by Pastrnak and <a href=\"http://www.espn.com/nhl/team/_/name/edm/edmonton-oilers\">Edmonton Oilers</a> star <a href=\"http://www.espn.com/nhl/player/_/id/3895074/connor-mcdavid\">Connor McDavid</a>.</p>\n<p><alsosee></p>\n<p>Among NHL teams, the Bruins had the top-selling jerseys as they set regular-season records for wins (65) and points (135). The rest of the top five for best-selling teams were the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>, Penguins, Capitals and 2022 Stanley Cup champion Avalanche.</p>\n<p>The Bruins again led the way in jersey sales during the playoffs' first round, although they were eliminated in seven games by the <a href=\"http://www.espn.com/nhl/team/_/name/fla/florida-panthers\">Florida Panthers</a>. The rest of the top five were the Maple Leafs, <a href=\"http://www.espn.com/nhl/team/_/name/sea/seattle-kraken\">Seattle Kraken</a>, Rangers and Devils. The Kraken won their first-ever playoff series in Round 1.</p>\n<p>According to Fanatics, NHL merchandise sales during the first round were up 45% over 2022. These sales are from across the Fanatics network of online stores, which includes the NHL's e-commerce stores in the U.S. and Canada.</p>\n\n\n\n\n",
  "<p>The <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> cleaned house Friday, as Fenway Sports Group <a href=\"https://www.espn.com/nhl/story/_/id/36187679/penguins-fire-president-ops-brian-burke-gm-ron-hextall\">fired</a> president of hockey operations Brian Burke, general manager Ron Hextall and assistant general manager Chris Pryor after the team missed the playoffs for the first time in 17 seasons.</p>\n<p>Who might be hired to fill those positions? What comes next for the franchise as it attempts to get back into the postseason in short order?</p>\n<p>Here's a look at the current and future state of the Penguins:</p>\n<p><offer></offer></p>\n<p><img src=\"http://a.espncdn.com/i/infographics/20170710_nfl_fpr/charts/_end_rule.png\" width=\"100%\"></p>\n<h2>Why was the front office fired?</h2>\n<p>The Penguins' core of <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a> was maintained so they could win a fourth Stanley Cup together. It was Hextall's mandate to re-sign Malkin and Letang last summer, and he fulfilled the obligation by inking Malkin, 36, to a four-year contract and Letang to a six-year deal, both with a $6.1 million average annual value.</p>\n<p>The problem was the supporting cast. Hextall and Burke made several player acquisitions that never had their desired effect. Injuries and ineffective goaltending combined to undermine the core's efforts to lead the Penguins back to the playoffs and, in the end, led to the front-office implosion.</p>\n<p><alsosee></p>\n<p>The company line from John Henry and Tom Werner of Fenway Sports Group:</p>\n<p>\"We are grateful to Brian, Ron, and Chris for their contributions to the organization over the past two seasons, but we feel that the team will benefit from new hockey operations leadership. While this season has been disappointing, we believe in our core group of players and the goal of contending for the Stanley Cup has not changed.\"</p>\n<p>The biggest factor here beyond the team's performance: Burke and Hextall were hired by the team's previous owners, Mario Lemieux and Ron Burkle. Fenway Sports Group didn't pay $900 million to watch diminishing returns under someone else's hires.</p>\n<p>That ownership group did approve a contract extension for head coach Mike Sullivan through the 2026-27 season, and he remained untouched in Friday's purge.</p>\n<hr>\n<h2>Who are the candidates to become the new GM?</h2>\n<p>The Penguins' GM search is going to be fascinating, because it's unclear who will do the hiring. The team doesn't have a CEO after David Morehouse stepped down. Does Fenway Sports Group hire a team president who hires the general manager? Or does it hire a GM empowered with both roles?</p>\n<p>The team announced that during the transition, hockey operations duties will be shared by director of hockey operations Alec Schall, AHL GM Erik Heasley and hockey operations analyst (and coach's challenge savant) Andy Saucier. Mike Sullivan will also assist in the transition of power.</p>\n<p>A few names to consider:</p>\n<ul>\n<li><strong>Jason Botterill</strong>, <a href=\"http://www.espn.com/nhl/team/_/name/sea/seattle-kraken\">Seattle Kraken</a> assistant general manager. He was a hot managerial prospect while working under Jim Rutherford with the Penguins, but only lasted three seasons as general manager of the <a href=\"http://www.espn.com/nhl/team/_/name/buf/buffalo-sabres\">Buffalo Sabres</a>. His tenure there looks more successful in hindsight -- acquiring <a href=\"http://www.espn.com/nhl/player/_/id/4024988/tage-thompson\">Tage Thompson</a> in the <a href=\"http://www.espn.com/nhl/player/_/id/5208/ryan-o'reilly\">Ryan O'Reilly</a> trade, drafting the likes of <a href=\"http://www.espn.com/nhl/player/_/id/4565228/dylan-cozens\">Dylan Cozens</a>, <a href=\"http://www.espn.com/nhl/player/_/id/4233575/casey-mittelstadt\">Casey Mittelstadt</a> and <a href=\"http://www.espn.com/nhl/player/_/id/4378656/mattias-samuelsson\">Mattias Samuelsson</a>. He'll get another GM job, and it could be back in Pittsburgh.</li>\n<li><strong>Ray Whitney</strong>, currently with the NHL Department of Player Safety. The 22-year NHL veteran winger was a finalist for the <a href=\"http://www.espn.com/nhl/team/_/name/sj/san-jose-sharks\">San Jose Sharks</a> GM job last offseason and should have an endorsement from league management. He has never been a GM or assistant GM, however.</li>\n<li><strong>Kyle Dubas</strong>, <a href=\"http://www.espn.com/nhl/team/_/name/tor/toronto-maple-leafs\">Toronto Maple Leafs</a> general manager. The 37-year-old doesn't have a contract after this season. If the Leafs fall short in the playoffs, it likely means the end of his tenure in Toronto. It's not exactly a leap to suggest that an ownership that once entrusted the Boston Red Sox to Theo Epstein wouldn't hesitate to hire someone like Dubas to run the Penguins.</li>\n<li>Some other current general managers could also gravitate to the Penguins, who are one of the NHL's flagship franchises.</li>\n</ul>\n<p>There's a ticking clock for Fenway Sports Group with the NHL draft looming in late June.</p>\n<p><photo2></p>\n<hr>\n<h2>What are the key decisions for the Penguins this summer?</h2>\n<p>Pittsburgh has 14 players under contract for next season and <a href=\"https://www.capfriendly.com/teams/penguins\">close to $21 million</a> in open cap space. Only seven of those players are forwards.</p>\n<p><inline1></p>\n<p>The next general manager will be tasked with finding the right mix of players to improve the team's 5-on-5 defense, which was 19th in expected goals against, while offering more offensive support for Crosby and Malkin's lines. On the back end, defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5738/brian-dumoulin\">Brian Dumoulin</a> is an unrestricted free agent and that group could use some bolstering.</p>\n<p>But the biggest area of concern has to be goaltending. <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> is an unrestricted free agent and will most certainly not be back after playing to a below replacement level this season. Backup <a href=\"http://www.espn.com/nhl/player/_/id/3025540/casey-desmith\">Casey DeSmith</a> has one more year remaining but isn't the answer. This could be priority No. 1 for the next GM.</p>\n<hr>\n<h2>What's next for Hextall, Burke?</h2>\n<p>Hextall had one more year left on his contract with the Penguins. It was his second stint as a general manager, following four years with the <a href=\"http://www.espn.com/nhl/team/_/name/phi/philadelphia-flyers\">Philadelphia Flyers</a>. He also won a Stanley cup as an assistant general manager with the <a href=\"http://www.espn.com/nhl/team/_/name/la/los-angeles-kings\">Los Angeles Kings</a>.</p>\n<p>The longtime NHL goaltender was always an odd fit for the Penguins. They were a win-now team, but Hextall's philosophy had always been focused on the draft and organizational prospect development. That's a really hard balance to strike when the modus operandi of the Penguins was to maximize their contention window with a core of star players in their mid-30s.</p>\n<p>Hextall will probably find another gig, perhaps with a team whose trajectory better fits his expertise. Ironically, one of those teams could be the Flyers. They have an <a href=\"https://www.espn.com/nhl/story/_/id/35842502/interim-gm-daniel-briere-says-flyers-quick-fix\">interim GM in Danny Briere</a> and the need for a president of hockey operations. There has been <a href=\"https://www.broadstreethockey.com/post/ron-hextall-actually-good-at-drafting-in-philadelphia-flyers-pittsburgh-penguins-general-manager-nhl/\">a reevaluation of Hextall's time as Flyers GM</a>; whether it's because of his drafting or the fan base's general feelings about Chuck Fletcher's performance as GM, Hextall is remembered more fondly five years later.</p>\n<p>Burke, 67, took over the Penguins as a stabilizing force less than two weeks after Rutherford resigned as general manager for personal reasons in 2021. (Rutherford is now president of hockey operations for the <a href=\"http://www.espn.com/nhl/team/_/name/van/vancouver-canucks\">Vancouver Canucks</a>.) Burke had been working for Sportsnet in Canada prior to his hiring, and the expectation is that he'll return to television in the near future.</p>\n\n\n\n\n",
  "<p>DETROIT -- <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Penguins</a> captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> became the 15th player in NHL history to reach 1,500 career points, scoring two goals and adding an assist in Pittsburgh's crucial 5-1 victory over the <a href=\"http://www.espn.com/nhl/team/_/name/det/detroit-red-wings\">Detroit Red Wings</a> on Saturday.</p>\n<p>\"This is a team sport,\" Crosby said. \"That's what we signed up for and that's why we love this game. Maybe you get certain milestones that get you to reflect a little more, but right now I'm just thinking about our situation and what we still need to do. I'm happy to have been a part of all of this, but my mentality has always been to try to be my best and take what happens from there.\"</p>\n<p>The Penguins are in danger of seeing a run of 16 straight Stanley Cup playoff berths come to an end. It's the longest active streak among the major North American sports leagues.</p>\n<p><inline1></p>\n<p>Crosby has 550 goals and 950 assists and is the sixth-fastest player to hit the 1,500-point milestone, accomplishing it in his 1,188th game. The milestone came on a power-play goal at 3:01 of the third period, with <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a> assisting.</p>\n<p>\"This is something only 15 players have ever done, and he's the sixth-fastest of all of them,\" Penguins coach Mike Sullivan said. \"I think that company speaks to this milestone and to the impact he's had on the game. Not only is he one of the greatest players of his generation, he's one of the greatest players in history.\"</p>\n<p><a href=\"http://www.espn.com/nhl/player/_/id/3792/david-perron\">David Perron</a>, who played parts of two seasons with Crosby from 2014 to '16, has seen it before.</p>\n<p>\"Incredibly impressive type of performance that he puts up at the right time,\" Perron said. \"That's what he does. I've seen it on the other bench. He's just a great guy, keeps working on his game. I ran into him at the All-Star break, we were at the same hotel. I got to spend some time with him. He just keeps working at it. He wants to keep getting better.\"</p>\n<p>Crosby became the 12th player in league history to reach 90 points in his age 35 season or older.</p>\n<p><inline2></p>\n<p><a href=\"https://www.espn.com/nhl/player/_/id/4024861\">Alex Nylander</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3151741/danton-heinen\">Danton Heinen</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> also scored for the Penguins, who are fighting for one of the last playoff berths in the Eastern Conference with less than a week left in the regular season.</p>\n<p>\"Why I like these type of games, that's a team fighting for their playoff lives and they played a really good game,\" Red Wings coach Derek Lalonde said. \"We just had flashes of being good today but just some of our egregious mistakes ended up on the wrong players' sticks and in the back of our net.\"</p>\n<p>Goaltender <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> had 19 saves and improved to 3-0-0 in his career against the Red Wings.</p>\n<p><a href=\"http://www.espn.com/nhl/player/_/id/4271732/pius-suter\">Pius Suter</a> scored for the Red Wings in the second period, his 14th of the season and one shy of his career best set last season. Detroit goalie <a href=\"http://www.espn.com/nhl/player/_/id/3151137/ville-husso\">Ville Husso</a> finished with 23 saves.</p>\n<p>Nylander, who was recalled from the AHL's Wilkes-Barre/Scranton Penguins on Friday, opened the scoring at 9:25 of the first period. It was his first goal since scoring for the <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a> against the <a href=\"http://www.espn.com/nhl/team/_/name/sj/san-jose-sharks\">San Jose Sharks</a> in March 2020.</p>\n\n\n\n\n",
  "<p><photo1></p>\n<p>Tuesday night's World Baseball Classic final between the United States and Japan featured some of the best Major League Baseball players in the world. </p>\n<p><alsosee></p>\n<p>It all came down to USA outfielder <a href=\"https://www.espn.com/mlb/player/_/id/30836/mike-trout\">Mike Trout</a> batting against his <a href=\"https://www.espn.com/mlb/team/_/name/laa/los-angeles-angels\">Los Angeles Angels</a> teammate <a href=\"https://www.espn.com/mlb/player/_/id/39832/shohei-ohtani\">Shohei Ohtani</a>. With two outs in the ninth inning and the USA trailing 3-2, Ohtani managed to strike out Trout to secure the title for Japan.</p>\n\n\n<p>It's always a treat when two incredible teammates face off. Here are some other examples we're remembering since the turn of the century.</p>\n\n\n<h2>Lionel Messi vs. Kylian Mbappe (2022 FIFA World Cup)</h2>\n<p><photo2></p>\n<p>The Paris Saint-Germain teammates put on a show in the World Cup final between Argentina and France. Messi's early penalty looked to be the difference in the game and Argentina was sitting on a 2-0 lead into the 80th minute. Mbappe put the team on his back, however, scoring on a penalty in the 80th and a volley in the 81st to send things to extra time. Messi looked to have the winning goal again in the 108th minute, but Mbappe scored again on a penalty in the 118th to become just the second player in history to record a hat trick in the men's World Cup final. Both players scored on their penalty tries, but Argentina ended up winning out.</p>\n\n\n<h2>Kobe Bryant vs. Pau Gasol (2008 Summer Olympics)</h2>\n<p><photo3></p>\n<p>Spain was the reigning FIBA world champion at the Summer Olympics but had to face off against the \"Redeem Team.\" Kobe Bryant led a squad featuring <a href=\"https://www.espn.com/nba/player/_/id/1966/lebron-james\">LeBron James</a>, Dwyane Wade and <a href=\"https://www.espn.com/nba/player/_/id/2779/chris-paul\">Chris Paul</a>, all coached by Mike Krzyzewski. Gasol put up 21 points to his <a href=\"https://www.espn.com/nba/team/_/name/lal/los-angeles-lakers\">Los Angeles Lakers</a> teammate Bryant's 20, but the USA prevailed 118-108.</p>\n\n\n<h2>Sue Bird vs. Lauren Jackson (2004 Summer Olympics)</h2>\n<p><photo4></p>\n<p>Bird and Jackson were anchors of the <a href=\"https://www.espn.com/wnba/team/_/name/sea/seattle-storm\">Seattle Storm</a> during the team's 2004 championship run. When the USA faced off against Australia in the women's basketball gold-medal game, Bird was mostly on the bench, with Jackson leading both teams in rebounds. The USA led the entire game and pulled ahead significantly in the fourth quarter, winning the gold medal with a 74-63 performance.</p>\n\n\n<h2>2010 Olympic men's hockey gold-medal game</h2>\n<p><photo5></p>\n<p>Some big names here -- <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> teammates <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> (Canada) and Brooks Orpik (USA) faced off, as did <a href=\"http://www.espn.com/nhl/team/_/name/chi/chicago-blackhawks\">Chicago Blackhawks</a> stars <a href=\"http://www.espn.com/nhl/player/_/id/3669/jonathan-toews\">Jonathan Toews</a> (Canada) and <a href=\"http://www.espn.com/nhl/player/_/id/3735/patrick-kane\">Patrick Kane</a> (USA). The real kicker, however, was Ryan Kresler scoring for the USA against his <a href=\"http://www.espn.com/nhl/team/_/name/van/vancouver-canucks\">Vancouver Canucks</a> teammate Roberto Luongo. Fortunately for Luongo, Canada prevailed 3-2 in overtime.</p>\n\n\n<h2>2002 Olympic men's hockey gold-medal game</h2>\n<p><photo6></p>\n\n\n<p>This one's a doozy. Team Canada defeated Team USA 5-2, but just look at the array of teammates who matched up here:</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>:</b> Theo Fleury and Eric Lindros (Canada) vs. Brian Leetch, Tom Poti, Mike York and Mike Richter (USA)</p>\n<p><inline1></p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/stl/st-louis-blues\">St. Louis Blues</a>:</b> Al MacInnis and Chris Pronger (Canada) vs. Keith Tkachuk, Doug Weight and Scott Young (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/col/colorado-avalanche\">Colorado Avalanche</a>:</b> Rob Blake, Adam Foote and Joe Sakic (Canada) vs. Chris Drury (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/det/detroit-red-wings\">Detroit Red Wings</a>:</b> Brendan Shanahan and Steve Yzerman (Canada) vs. Chris Chelios and Brett Hull (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/nj/new-jersey-devils\">New Jersey Devils</a>:</b> Martin Brodeur and Scott Niedermayer (Canada) vs. Brian Rafalski (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/phi/philadelphia-flyers\">Philadelphia Flyers</a>:</b> Simon Gagne (Canada) vs. John LeClair and Jeremy Roenick (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/dal/dallas-stars\">Dallas Stars</a>:</b> Joe Nieuwendyk (Canada) vs. Mike Modano (USA)</p>\n<p><b><a href=\"http://www.espn.com/nhl/team/_/name/sj/san-jose-sharks\">San Jose Sharks</a>:</b> Owen Nolan (Canada) vs. Gary Suter (USA)</p>\n<p>Lots of bragging rights for the Canadian teammates in those eight locker rooms post-Olympics, we bet.</p>\n\n\n\n\n",
  "<p>LOS ANGELES -- There aren't many occasions anymore when one can say <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> did something in a game for the first time. Saturday night, though, he accomplished a first he hoped to avoid.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">Crosby, the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> superstar, received a game misconduct for the first time in his 18-year NHL career midway through the third period of a 6-0 loss to the <a href=\"http://www.espn.com/nhl/team/_/name/la/los-angeles-kings\">Los Angeles Kings</a>.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">Crosby was battling for position with Kings defenseman <a href=\"http://www.espn.com/nhl/player/_/id/4588178/mikey-anderson\">Mikey Anderson</a> in front of the net and was knocked to the ice.</p>\n<p>Anderson ended up being called for cross-checking. Anderson and Crosby exchanged words as Anderson skated to the penalty box and Crosby ended up shoving Anderson. Both players ended up getting 10-minute misconduct penalties, but Crosby's got elevated to a game misconduct, which carries an automatic ejection, after continuing to chirp at referee Garrett Rank.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">\"I could tell he (Anderson) was saying something. I don't know what he was saying because we were pretty far from each other. I got closer and that happens often in a lot of scrums,\" Crosby said. \"Honestly, I was shocked that I was getting kicked out of the game. I had no idea.\"</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">Pittsburgh coach Mike Sullivan said he didn't receive a reason on why Crosby received a game misconduct.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">\"I don't think Garrett had any interest in giving us an explanation,\" Sullivan said.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">The 20 penalty minutes were the second-highest Crosby has had in 1,160 career games. It is only the fifth time he has had at least 10 minutes of penalties in a game.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">While Crosby was surprised to get the game misconduct, he wasn't about to say how he really felt.</p>\n<p xmlns=\"http://iptc.org/std/NITF/2006-10-18/\">\"I mean, can I really say what I think anyway? Let's be honest here,\" he said.</p>\n\n\n\n",
  "<p>SUNRISE, Fla. -- <a href=\"http://www.espn.com/nhl/team/_/name/wsh/washington-capitals\">Washington Capitals</a> star <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> said partnering with son Sergei and <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> for an NHL All-Star skills event Friday night was a \"special moment\" for all three and the game of hockey. </p>\n<p>Crosby, 35, and Ovechkin, 37, were a dual-entry in the breakaway challenge trick-shot competition at FLA Live, home of the <a href=\"http://www.espn.com/nhl/team/_/name/fla/florida-panthers\">Florida Panthers</a>.</p>\n<p>They skated out to center ice together, where they were soon joined by 4-year-old Sergei Ovechkin, who had watched the event with his father near the benches while wearing an \"Ovi Jr.\" jersey. The trio skated together toward Hall of Famer Roberto Luongo, tending goal for the event.</p>\n<p><alsosee></p>\n<p>Crosby and Alex Ovechkin passed the puck to each other, with Sergei Ovechkin enthusiastically tapping his stick on the ice for a pass. His father eventually passed him the puck, he scored through a sprawling Luongo and then celebrated with the other NHL All-Stars watching from the benches.</p>\n<p>The trio won the event with a perfect score of 40 points from the celebrity judges.</p>\n<p>\"It was very cool. Everybody enjoyed it. Obviously, Sergei was always smiling,\" said Alex Ovechkin, who is 82 goals away from tying Wayne Gretzky's NHL record (894). \"That's a special moment. It's great for the game and great for both of us. And for Sergei as well.\"</p>\n<p>Crosby said that once he and Ovechkin decided to enter the breakaway challenge together, performing with Sergei Ovechkin was the first and only idea they had for the event.</p>\n<p>\"It was nice to have his son be a part of it and fun to share that moment,\" Crosby said. \"His son loves the game.\"</p>\n<p>The two NHL stars have been linked since entering the NHL as rookies in the 2005-06 season, eventually becoming the biggest player vs. player rivalry in hockey. Their teams met four times in the playoffs, with the Penguins winning three series. They battled for MVP honors, scoring titles and Olympic glory. That their personalities were so different -- Crosby as a soft-spoken Canadian, Ovechkin as a brash Russian star -- only created more of a juxtaposition between the stars.</p>\n<p><photo1></p>\n<p>Crosby said it doesn't surprise him that he and Ovechkin have this kind of relationship 18 years into their storied careers.</p>\n<p>\"Before we ever played a game against each other, there was a rivalry.\" Crosby said. \"It was always set up that way. I think over time, you understand that it gets heated and intense on the ice. We both want to have success. But you appreciate you playing against each other for as long as it's been. To still be in a tight playoff race against each other all these years later, to see what he's doing, you just appreciate all that.\"</p>\n<p>The Penguins are three points back of the Capitals in the standings with four games in-hand. Both teams occupy the final wild-card spots in the Eastern Conference.</p>\n<p>Both Ovechkin and Crosby said they appreciated being the veteran stars with whom younger players at the All-Star Game were honored to share the ice.</p>\n<p>\"I would think if you asked him the same thing, he would tell you that when we were young players and there were older guys [in the All-Star Game], we felt the same way,\" Crosby said. \"Even though we're a little older, we appreciate the opportunity to spend some time with guys.\"</p>\n<p>Said Ovechkin: \"I remember when I was a little younger, we would share a bench with legends. Those were special moments.\" </p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> will be appointed as an officer of the Order of Canada, officials announced Thursday, as the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> captain receives one of the country's highest honors.</p>\n<p>Crosby, a three-time Stanley Cup champion who helped Canada win two Olympic gold medals, is among 99 new appointments. His selection is in recognition of \"being one of the greatest hockey players of all time and for supporting community service initiatives for youth,\" Mary Simon, the Governor General of Canada, said in a statement.</p>\n<p><alsosee></p>\n<p>Also among the honorees is Karina LeBlanc, who played for the Canadian women's national team at five Women's World Cups and currently serves at the general manager of Portland Thorns FC in the NWSL.</p>\n<p>Hailed as \"The Next One\" before he played his first NHL game, Crosby, 35, has had one of the most decorated careers in professional hockey. He has twice collected the Conn Smythe Trophy, awarded to the playoff MVP, and was selected to his eighth All-Star game in 2019.</p>\n<p>\"The NHL is grateful for all he has given to the game and joins his millions of fans throughout Canada and around the world in celebrating this prestigious and well-deserved honour,\" the league said in a statement.</p>\n<p><i>Reuters contributed to this report.</i></p>\n\n",
  "<p><video1></video1></p>\n\n\n<p><a href=\"https://www.espn.com/mlb/team/_/name/laa/los-angeles-angels\">Los Angeles Angels</a> pitcher/DH <a href=\"https://www.espn.com/mlb/player/_/id/39832/shohei-ohtani\">Shohei Ohtani</a> had a 2.33 ERA and an .875 OPS in 2022. <a href=\"https://www.espn.com/mlb/team/_/name/nyy/new-york-yankees\">New York Yankees</a> outfielder <a href=\"https://www.espn.com/mlb/player/_/id/33192/aaron-judge\">Aaron Judge</a> led the league in OPS, runs, RBIs and set the American League home run record with 62. In any other year, either would be the obvious choice for AL Most Valuable Player -- but they happened to have put up those numbers in the same season. While Judge is the odds-on favorite to win, would anyone really object if the vote was close -- or even if it were tied?</p>\n<p><alsosee></p>\n<p>It wouldn't be the first time something like this would have happened. Close MVP races -- or even ties -- are rare, but they're not unprecedented. Here are some races from the past 30 years where the voters just couldn't quite decide on a clear favorite.</p>\n\n\n\n<h2>MLB</h2>\n<p><photo2></p>\n<p><b>2017: <a href=\"https://www.espn.com/mlb/player/_/id/30583/giancarlo-stanton\">Giancarlo Stanton</a> beats <a href=\"https://www.espn.com/mlb/player/_/id/28670/joey-votto\">Joey Votto</a> by two votes</b></p>\n<p>In his final year with the <a href=\"https://www.espn.com/mlb/team/_/name/mia/miami-marlins\">Miami Marlins</a>, Stanton mashed 59 home runs, led the league in RBIs with 131 and OPS+ with 169. Votto, stalwart as ever with the <a href=\"https://www.espn.com/mlb/team/_/name/cin/cincinnati-reds\">Cincinnati Reds</a>, led in overall OPS (1.032), OBP (.454) and walks (134). Their performances at the plate were so outrageously good that voters didn't mind much that neither the Marlins nor the Reds made the playoffs. It was the closest race in MLB since 1979, when Willie Stargell and Keith Hernandez tied for NL MVP.</p>\n\n\n<h2>NBA</h2>\n<p><photo3></p>\n<p><b>2004-05: Steve Nash beats Shaquille O'Neal by 2.6% voting share</b></p>\n<p>This season was the first of three consecutive MVP seasons where Nash, playing for the <a href=\"https://www.espn.com/nba/team/_/name/phx/phoenix-suns\">Phoenix Suns</a>, would lead the league in assists per game, this time with 11.5. O'Neal, in his first year with the <a href=\"https://www.espn.com/nba/team/_/name/mia/miami-heat\">Miami Heat</a>, put up a pretty typical Shaq statline -- 22.9 PPG, 10.4 RPG, and 2.3 BPG. Both teams finished first in their respective divisions and made deep playoff runs, but the Suns fell to the <a href=\"https://www.espn.com/nba/team/_/name/sa/san-antonio-spurs\">San Antonio Spurs</a> and the Heat lost to the <a href=\"https://www.espn.com/nba/team/_/name/det/detroit-pistons\">Detroit Pistons</a> in their conference finals.</p>\n\n\n<h2>WNBA</h2>\n<p><photo7></p>\n<p><b>2013: <a href=\"https://www.espn.com/wnba/player/_/id/812/candace-parker\">Candace Parker</a> beats Maya Moore by 16 points</b></p>\n<p>This one was a three-way race, with the <a href=\"https://www.espn.com/wnba/team/_/name/la/los-angeles-sparks\">Los Angeles Sparks'</a> Parker (17.9 PPG, 8.7 RPG) beating out both the <a href=\"https://www.espn.com/wnba/team/_/name/min/minnesota-lynx\">Minnesota Lynx's</a> Moore (18.5 PPG, 6.2 RPG) and rookie <a href=\"https://www.espn.com/wnba/player/_/id/2491877/elena-delle-donne\">Elena Delle Donne</a> (18.1 PPG, 5.6 RPG), who had seven first-place votes in her rookie season with the <a href=\"https://www.espn.com/wnba/team/_/name/chi/chicago-sky\">Chicago Sky</a>.</p>\n\n\n<p><b>2005: Sheryl Swoopes beats Lauren Jackson by two points</b></p>\n<p>The <a href=\"https://www.espn.com/wnba/team/_/name/sea/seattle-storm\">Seattle Storm</a>'s Jackson (17.6 PPG, 9.2 RPG, 2.0 BPG) actually had more first-place votes than the Houston Comets' Swoopes (18.6 PPG, 4.3 APG, 2.0 SPG), but Swoopes beat her out in total points. If Jackson had received one more fourth-place vote instead of a fifth-place one, the two would have had equal point totals.</p>\n\n\n\n<h2>NFL</h2>\n<p><photo4></p>\n<p><b>2003: Peyton Manning and Steve McNair tie</b></p>\n<p>Manning shared his first of five MVP awards with Steve McNair. McNair, playing for the <a href=\"https://www.espn.com/nfl/team/_/name/ten/tennessee-titans\">Tennessee Titans</a>, threw for 3,215 yards, 24 touchdown passes and 6 interceptions, adding another four scores on the ground. Manning, playing for the <a href=\"https://www.espn.com/nfl/team/_/name/ind/indianapolis-colts\">Indianapolis Colts</a>, led the NFL in passing yards with 4,267, throwing 29 touchdown passes and 10 interceptions. Both quarterbacks would lose in the playoffs that year to the third-place finisher: then-New England Patriots signal-caller <a href=\"https://www.espn.com/nfl/player/_/id/2330/tom-brady\">Tom Brady</a>.</p>\n\n\n<p><b>2002: Rich Gannon beats Brett Favre by four votes</b></p>\n<p>Gannon, playing for the then-Oakland Raiders, had by far the best season of his career, throwing for 4,689 yards, 26 touchdowns and 10 interceptions and leading his team to the Super Bowl. Favre was in full high-risk, high-reward mode, leading the league in TD passes with 32 but also throwing 21 INTs.</p>\n\n\n<p><b>2001: Kurt Warner beats Marshall Faulk by four votes</b></p>\n<p>A bit of an awkward race considering Warner and Faulk were teammates on the then-<a href=\"https://www.espn.com/nfl/team/_/name/lar/los-angeles-rams\">St. Louis Rams</a>. Both were key reasons why the Rams made it to their second Super Bowl in three years -- Warner threw for 4,830 yards, 36 touchdowns and 22 interceptions, while Faulk was an incredible dual threat, rushing for 1,382 yards and 12 scores and putting up 765 yards receiving and 9 receiving touchdowns.</p>\n\n\n<p><b>1997: Brett Favre and Barry Sanders tie</b></p>\n<p>Favre, in the last of three consecutive MVP seasons, led the <a href=\"https://www.espn.com/nfl/team/_/name/gb/green-bay-packers\">Green Bay Packers</a> to a Super Bowl appearance in 1997, throwing for 3,867 yards, 35 touchdowns and 16 interceptions. Sanders, on the other hand, put the <a href=\"https://www.espn.com/nfl/team/_/name/det/detroit-lions\">Detroit Lions</a> on his back, rushing for an astounding 2,053 yards,11 scores and adding three more receiving touchdowns. The Lions lost in the wild-card round, and Sanders would play one more year before retiring.</p>\n\n\n<h2>NHL</h2>\n<p><photo5></p>\n<p><b>2012-13: <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> beats <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> by 1.8 percent</b></p>\n<p>The lockout-shortened 2012-13 season saw Ovechkin and Crosby each putting up 56 points. Ovechkin's league-leading 32 goals, however, might have been the deciding factor in his narrow win.</p>\n\n\n<p><b>2001-02: Jose Theodore beats Jarome Iginla by first-place votes</b></p>\n<p>Theodore and Iginla actually had the same number of votes for the Hart Memorial Trophy. Theodore, who led the league with a .931 save percentage, ended up beating Iginla, who led the league in goals (52) and points (96) due to receiving three more first-place votes.</p>\n\n\n<p><b>1999-2000: Chris Pronger beats Jaromir Jagr by one point</b></p>\n<p>Jagr led the league in points with 96 (ironically, his lowest point total from 1997-2001) but Pronger's league-leading 52 plus/minus was a factor in making him the first defenseman to win the Hart since Bobby Orr in 1972. Pronger is also the last defenseman to win the award.</p>\n\n\n<h2>College football</h2>\n<p><photo6></p>\n<p><b>2009: Mark Ingram beats Toby Gerhart by 28 votes</b></p>\n<p>Nobody could stop Mark Ingram (1,658 yards rushing, 17 touchdowns) or the champion Alabama Crimson Tide in 2009, but Stanford Cardinal running back Toby Gerhart (1,871 yards rushing, 28 touchdowns) gave it a go in the Heisman Trophy voting. Ingram's win is the smallest margin of victory by a Heisman Trophy winner ever.</p>\n\n\n<p><i>Research from ESPN Stats and Information was used in this article.</i></p>\n\n\n\n\n",
  "<p><strong>PITTSBURGH -- <a href=\"https://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">SIDNEY CROSBY</a> DOESN'T</strong> scare easily. But the future of the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> had him unnerved.</p>\n<p>Center <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> and defenseman <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a>, Crosby's teammates on all three of his Stanley Cup victories, were at the end of their contracts last season. Free agency loomed. Rare was the team, in hockey or any other sport, that would keep an aging core together that hadn't advanced past the playoffs' opening round in four straight seasons -- let alone find a way to do so under a flat salary cap.</p>\n<p>\"I was sweatin',\" Crosby told ESPN. \"You know how it works. The longer it goes, the closer it gets to free agency, the greater the chances are you might want to test it. You're trying to balance being optimistic with being realistic about the fact it was a possible [they'd leave].\"</p>\n<p>Penguins coach Mike Sullivan led all three players to Stanley Cup wins in 2016 and 2017. He couldn't begin to imagine how Crosby would captain a Pittsburgh team without Malkin and Letang on the roster.</p>\n<p>\"It would have been hard for him. Those three have been through a lot together,\" Sullivan said. \"They've had their fair amount of successes, but they've also had their disappointments. I think it means a lot to him to continue to try to win; but in particular, to continue to try to win with those guys.</p>\n<p>\"I can't imagine what it would have been like for Sid to go through. I'm glad we don't have to find out.\"</p>\n<p><alsosee></p>\n<p>Letang, 35, signed a six-year contract extension on July 7 worth $36 million. Five days later, Malkin, 36, signed a four-year, $24.4 million contract. That was right after news leaked that Malkin intended to test free agency, when tense talks with Pittsburgh finally stalled.</p>\n<p>Sullivan remembers being optimistic that they'd both return to Pittsburgh -- until hearing about Malkin's negotiations, that is.</p>\n<p>\"I always believed we'd get it done, up until maybe the last 48 hours before free agency with Geno,\" he said. \"That was the only time that doubt crept into my mind. But in my heart I believed that we'd be able to retain these guys. I know what it means to them.\"</p>\n<p>What did it mean to Crosby?</p>\n<p>\"Just ... happy,\" he said. \"Relieved. And then immediately thinking, 'OK, we've got an opportunity. These guys are staying. And now we've gotta do something with it.'\"</p>\n<p><a href=\"https://www.espn.com/nhl/story/_/id/34535990/2022-23-nhl-schedule-how-watch-espn-espn+-hulu-abc\"><strong><em>How to watch the 2022-23 NHL season on ESPN networks -- including 103 exclusive games and the out-of-market package (over 1,050 games)</em></strong></a></p>\n<hr>\n<p><strong><a href=\"https://www.espn.com/nhl/player/_/id/2591155/bryan-rust\">BRYAN RUST</a> IS</strong> part of the band, too.</p>\n<p>\"Yeah, I might be the third backup singer,\" he said.</p>\n<p>Rust, 30, was expected to generate significant interest as an unrestricted free agent. The winger has been a perfect complement to Crosby and <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a> on the Penguins' top line, and skated well when matched with Malkin, too.</p>\n<p>There were times Rust wasn't convinced the core would stay together. He remembers sitting at his locker after losing Game 7 in overtime to the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a> last May and being unable to shake that dread.</p>\n<p>\"I was like, 'Oh s--- ... is this my last chance with this team?'\" he said. \"Because of how the business works, and because the cap is the way it is.\"</p>\n<p>Turns out, Rust was the first member to stay with the band, signing a six-year contract extension on May 21 worth $30.75 million. He didn't test the waters to see what other riches were out there from NHL contenders. He feels the free agents who stayed with the Penguins made out fine financially, with Pittsburgh understanding they weren't going to take steep discounts to stay.</p>\n<p>\"Everyone has to do what's best for them and the business, but [also] as a team and as individuals,\" he said. \"Those guys want to win. They want to be here. I'm no different. That point was made clear, but we weren't going to lose out individually.\"</p>\n<p><photo2></p>\n<p>Letang was another player many expected could test the market. Despite entering his 17th NHL season, his effectiveness as a defenseman hasn't waned. He played 78 games last season and posted 68 points, with an average time on ice per game of 25:47. Letang finished seventh in the Norris Trophy race, the fourth straight season he received votes.</p>\n<p>He would have elevated the blue line of many contenders. There was also talk of him joining his former agent, Kent Hughes, in Montreal, where Hughes is now the <a href=\"http://www.espn.com/nhl/team/_/name/mtl/montreal-canadiens\">Canadiens</a>' general manager.</p>\n<p>Letang was never sure if he would end up staying with the Penguins. \"Otherwise I would have been signed the summer before. Would have been easier, right?\" he said with a laugh.</p>\n<p>His conversations with Crosby hinted at that uncertainty.</p>\n<p>\"Sid is probably my closest friend. We talked about the entire summer and the entire year,\" Letang said. \"We weren't sure if it was going to happen. So we're glad it's behind us and we can look forward.\"</p>\n<hr>\n<p><strong>OF THE PENGUINS'</strong> holy trinity, Crosby and Letang don't have many doubters about their continued excellence at their advancing age.</p>\n<p>Malkin is a different story.</p>\n<p>The former Hart Trophy and Conn Smythe Award winner had major knee surgery before last season, as his right ACL was repaired for a second time. While his point production remained strong -- he posted 42 points in 41 games, including 20 goals -- it appeared he had lost a step. The Pittsburgh Post-Gazette noted that Malkin's rush attempts had trailed off significantly, as he generated 0.57 per 60 minutes two seasons before his 2021 knee surgery compared to just 0.22 rush attempts on average last season.</p>\n<p>\"On numerous instances, Malkin's skating looked like what you'd expect from a 35-year-old less than a year removed from his second significant knee injury,\" wrote the Gazette's Mike DeFabo.</p>\n<p>As the transition game is a key to Sullivan's system, that impacted Malkin's effectiveness at even strength. Sullivan called Malkin's 5-on-5 game \"sporadic\" last season, but said last week that he hasn't made many adjustments to Malkin's usage based on that decline.</p>\n<p>\"Nothing's really changed in how we use him,\" Sullivan said. \"He's still a dynamic offensive talent who has the ability to single-handedly take over a game. There aren't a lot of those guys around the league.\"</p>\n<p><photo3></p>\n<p>One change Sullivan made last season that could stick for 2022-23: Moving Rust to play with Malkin. Sullivan said Malkin's best games came with Rust on his wing, thanks to the latter's ability to forecheck and his defensive awareness. Crosby and Guentzel have spent time this preseason with winger <a href=\"http://www.espn.com/nhl/player/_/id/2562629/rickard-rakell\">Rickard Rakell</a>, who isn't a \"band member\" per se but who signed a six-year, $30 million contract to stay in Pittsburgh before free agency this summer.</p>\n<p>Rust was happy to see Malkin back. Much like with Letang, Rust couldn't fathom how the Penguins could improve their impact on the ice without sacrificing something off the ice if they let the duo walk.</p>\n<p>\"Someone else could come in here, but why disrupt this chemistry in the face of getting more of the same, when we know we have a team that can do something?\" he said. \"[Without Malkin and Letang], there would have been a lot of conversations floating around about not having them in this room. Thank god those aren't happening.\"</p>\n<p>Letang said the feeling was mutual about Rust and Malkin.</p>\n<p>\"If you lose Geno, if you lose Rusty, can you actually replace them? Are you getting better by not having them? I don't think so.\"</p>\n<p>Does Letang believe there's another Stanley Cup in this group?</p>\n<p>\"That's what I want. For sure.\"</p>\n<hr>\n<p><strong>MIKE SULLIVAN MIGHT</strong> not skate with Crosby, Malkin and Letang during games, but he's a member of the band, too. The contract extensions weren't exclusive to the players: Sullivan, who has coached the Penguins since the 2015-16 season, signed a three-year deal that pays him into 2026-27.</p>\n<p>\"We've been through a lot together. This hasn't been all apple pie and ice cream. We've had hard conversations over the years,\" Sullivan said of his core. \"I couldn't be more humbled to continue to get to coach these guys. I just think the world of them. It's hard to keep a team together in sports. That's what I think is so great about this circumstance.\"</p>\n<p>The Fenway Group, the Penguins' new owners, didn't balk at approving new contracts for Letang and Malkin. Neither did general manager Ron Hextall, who sought to build around the veteran stars as they play out the rest of their years in Pittsburgh.</p>\n<p>\"In a perfect world, Geno retires a Penguin. And I think Tanger's the same,\" Hextall said before free agency. \"These two are generational players. They don't come along very often.\"</p>\n<p>Rust believes the Penguins' recent playoff performances made Hextall's call easier.</p>\n<p>\"There's such a fine line in the playoffs between winning and losing. There are some years when you get in when you can just tell,\" he said. \"You're getting dominated and you're like, 'OK, maybe we need to make some changes.' But you could see not just last year, but the year before, that those were series we could have and should have won. Management saw that too.\"</p>\n<p>On paper, they were opening-round failures: a six-game loss to the <a href=\"http://www.espn.com/nhl/team/_/name/nyi/new-york-islanders\">New York Islanders</a> after the COVID-shortened 56-game season in 2020-21, and a seven-game loss to the Rangers last postseason. Yet both series had mitigating circumstances.</p>\n<p>The Islanders defeated the Penguins in a series that saw goalie <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> implode, with backup <a href=\"http://www.espn.com/nhl/player/_/id/3025540/casey-desmith\">Casey DeSmith</a> unavailable to bail them out due to injury.</p>\n<p>Against the Rangers, nothing went right for the Penguins. DeSmith was injured during a brilliant Game 1 performance, leaving the game in double overtime with a core muscle issue that put him out for the series. Jarry was out with an injury until Game 7, when he replaced the struggling <a href=\"http://www.espn.com/nhl/player/_/id/2560083/louis-domingue\">Louis Domingue</a> only to lose in overtime. Defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5738/brian-dumoulin\">Brian Dumoulin</a> and Rakell were both lost after Game 1, too.</p>\n<p>Pittsburgh had a 3-1 series lead when a <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a> hit injured Crosby in Game 5, turning the series on its ear: The Rangers scored three goals in 2:42 to take the lead for good, and rallied with three straight wins to take the series.</p>\n<p>\"We had a good team. It didn't go our way. We played some of our best hockey in the playoffs and we didn't manage to win those series,\" Letang said. \"We had the team to make a run for it, but we didn't get the bounces we needed. To take a run at it again was the right thing to do.\"</p>\n<p><photo4></p>\n<p>That hunger thrives as part of the Penguins' culture. Defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5407/jeff-petry\">Jeff Petry</a>, whom they acquired from Montreal, felt it immediately when he arrived for training camp.</p>\n<p>\"What those guys have together is special,\" he said. \"They've obviously been to the top. The thing I noticed is that's not enough. They want to do it again.\"</p>\n<p>That's why the band is back together: To make another push toward a fourth Stanley Cup in the Sidney Crosby era. They know there will be skepticism. Some will see this as a nostalgia play from a team that refuses to turn the page on past glory. Some will note that Father Time is undefeated and that the Penguins' core has a combined age of 106 years old -- the window to contend must close at some point.</p>\n<p>But Sullivan and his players make the following counterargument: Gaze upon the past two postseasons and tell us that window isn't still agape. Tell us that this band doesn't have another chart-topper in it.</p>\n<p>\"When you look at those two series -- and both of those opponents went to the conference finals -- we felt good about our team,\" Sullivan said. \"Our core players were a big part of it. They're providing evidence that there's still elite play in them.</p>\n<p>\"We recognize that we're getting older. But we're not old. There's a difference.\"</p>\n\n\n\n\n",
  "<p>PITTSBURGH -- <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> general manager <a href=\"http://www.espn.com/nhl/player/_/id/4350/ron-hextall\">Ron Hextall</a> says he wants to find a way to have <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a> stay with the club for the rest of their careers.</p>\n<p>\"In a perfect world, [Malkin] retires a Penguin,\" Hextall said Monday. \"And I think Tanger's the same.\"</p>\n<p>In a perfect world, anyway.</p>\n<p>The NHL in the salary-cap era is hardly that.</p>\n<p><alsosee></p>\n<p>Perhaps that's why, when Hextall was asked what was missing this season from a group that let a 3-1 lead slip <a href=\"https://apnews.com/article/nhl-sports-new-york-rangers-hockey-2b5fa37782968acc6a66ed1f55f31536\">away in a first-round loss to the </a><a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>, he said jokingly that \"a little more cap space would be great.\"</p>\n<p>He's not getting it.</p>\n<p>The Penguins have habitually spent up to the cap limit during the hugely successful era led by Malkin, Letang and longtime captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>. That \"spend to win now\" approach is not going to change with Fenway Sports Group now signing the checks <a href=\"https://apnews.com/article/nhl-mlb-sports-business-pittsburgh-7a8bfeb7dcd365b52c4982835bc3ac08\">after buying the club from Ron Burkle and Hall of Famer </a><a href=\"http://www.espn.com/nhl/player/_/id/1084/mario-lemieux\">Mario Lemieux</a> last fall.</p>\n<p>The question, however, is how much money the Penguins are willing to offer a pair of 35-year-old franchise icons who are less than two months away from entering free agency for the first time.</p>\n<p>Letang hardly appears to have lost a step. The defenseman is coming off a season in which he collected a career-high 68 points while playing a bit more responsibly in his own end. He averaged a staggering 25 minutes, 47 seconds of ice time and said last week he'd like to play at least five more seasons.</p>\n<p>Letang also is finishing a contract that paid him $7.25 million a season. Considering his fitness level and his production, it's reasonable to think he'd command a bit of a raise on the open market, though Letang said last week <a href=\"https://apnews.com/article/nhl-sports-new-york-pittsburgh-rangers-5b0f847daf51c4ab00e5e12e7efca6b8\">his preference would be to find a way to stay</a> in Pittsburgh.</p>\n<p>Malkin feels likewise, but his situation is thornier. He said \"good players sign good contracts\" last week, and while he scored 20 goals this season despite missing nearly half of the year while recovering from a torn ACL in his right knee, he was not particularly effective in 5-on-5 situations while commanding $9.5 million. He also turns 36 in July and has missed at least 10 games because of injuries nine times in his past 10 seasons.</p>\n<p>Hextall stressed he would not provide details on the nature of the team's talks with Malkin and Letang but hinted he's not concerned about their age.</p>\n<p>\"They're both great athletes,\" he said. \"They both have been here a long time. They're both performing at a high level right now. We'd certainly like to have them in the mix come September.\"</p>\n<p>Malkin and Letang's respective statuses are the two biggest pieces of a very unwieldy puzzle Hextall has to piece together over the summer. Forwards <a href=\"http://www.espn.com/nhl/player/_/id/3648008/evan-rodrigues\">Evan Rodrigues</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3648/brian-boyle\">Brian Boyle</a>, Rickard Rakell and backup goaltender <a href=\"http://www.espn.com/nhl/player/_/id/3025540/casey-desmith\">Casey DeSmith</a> are set to become free agents, while forwards <a href=\"http://www.espn.com/nhl/player/_/id/3151741/danton-heinen\">Danton Heinen</a> and the enigmatic <a href=\"http://www.espn.com/nhl/player/_/id/3114775/kasperi-kapanen\">Kasperi Kapanen</a> are restricted free agents.</p>\n<p>Hextall did lock down one piece of the puzzle, <a href=\"https://www.espn.com/nhl/story/_/id/33960829/pittsburgh-penguins-act-fast-give-six-year-contract-extension-bryan-rust-week-elimination\">signing forward </a><a href=\"http://www.espn.com/nhl/player/_/id/2591155/bryan-rust\">Bryan Rust</a> to a six-year deal over the weekend that will keep the versatile two-time Stanley Cup winner in the fold through 2028. Rust, who had 24 goals and 34 assists this season, underwent what Hextall called a minor procedure on one of his knees recently but should be ready well ahead of training camp.</p>\n<p>By then Hextall will have clarity on his team's immediate future. He indicates he has it on its immediate past, praising the Penguins for their resiliency during an eventful season that included extended absences by Crosby and Malkin and a COVID-19 outbreak. Pittsburgh managed to extend its playoff streak to 16 straight years, the longest active streak in major North American professional sports.</p>\n<p>Yet the Penguins also haven't made it out of the first round since 2018. That's not the standard for a team that plays in an arena with five Stanley Cup banners hanging from the rafters.</p>\n<p>Six months into FSG's tenure, there appears to be no hurry to make drastic changes, including in the front office. Hextall, who took over in February 2021 after Jim Rutherford's abrupt resignation, appears as if he will get a chance to guide the team through at least the early stages of the twilight of Crosby's Hall of Fame career.</p>\n<p>\"Everything is good,\" Hextall said. \"[Fenway Sports Group is] totally committed to winning. ... We've got some things that we're looking at in terms of adding to staff and stuff. We're moving along.\"</p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> star center <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> and goalie <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> returned to the starting lineup for Sunday's Game 7 against the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">Rangers</a> in New York.</p>\n<p>The players had been listed as \"game-time decisions\" by coach Mike Sullivan.</p>\n<p>Crosby, who had nine points in the first five games of the series, left Game 5 after suffering an upper-body injury from a high hit delivered by Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a> in the second period. New York rallied to win that game. Sources told ESPN on Friday that Crosby was held out of Pittsburgh's 5-3 loss in Game 6 with a concussion. The Rangers also rallied to win that game, pushing the series to Game 7.</p>\n<p>Crosby skated individually on Friday with skills coach Ty Hennes and then participated in practice with Pittsburgh on Saturday. He did not take an optional practice on Sunday at Madison Square Garden.</p>\n<p>\"The word concussion can be used loosely, but head injuries are very serious,\" Crosby's agent, Pat Brisson, told ESPN. \"The Penguins are being very careful and very smart about this. What's most important is Sidney's well being as a person. He's being evaluated and they're doing everything by the book. A final decision on if he plays tonight will be made by the team doctor.\"</p>\n<p><alsosee></p>\n<p>Jarry hasn't played since April 14 after suffering a broken foot. Backup <a href=\"http://www.espn.com/nhl/player/_/id/3025540/casey-desmith\">Casey DeSmith</a> played well in leading the Penguins down the stretch. He started Game 1 against the Rangers but had to leave in double-overtime with an injury. DeSmith underwent core muscle surgery and was ruled out of the playoffs.</p>\n<p>Third-stringer <a href=\"http://www.espn.com/nhl/player/_/id/2560083/louis-domingue\">Louis Domingue</a> led the Penguins in their Game 1 triple-overtime win but had a .898 save percentage and a 3.65 goals-against average in six games. He struggled in Game 6, including on Chris Kreider's game-winning goal in the third period.</p>\n<p>Jarry took part in Sunday's optional practice and appeared to go through the routine of a starter, including leaving the ice first. Sullivan refused to name a starting goalie for Game 7.</p>\n<p>This could be Jarry's first playoff start since the Penguins' first-round loss to the <a href=\"http://www.espn.com/nhl/team/_/name/nyi/new-york-islanders\">New York Islanders</a> in 2021, a six-game series in which he struggled, registering an .888 save percentage and a 3.18 goals-against average.</p>\n<p>In other Penguins injury news, defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5738/brian-dumoulin\">Brian Dumoulin</a> remains out after being injured in Game 1. Forward <a href=\"http://www.espn.com/nhl/player/_/id/3648/brian-boyle\">Brian Boyle</a>, one of the team's key penalty killers, is week-to-week after a lower-body injury in Game 6. Forward <a href=\"http://www.espn.com/nhl/player/_/id/2562629/rickard-rakell\">Rickard Rakell</a>, who was injured in a hit in Game 1, will also play after being listed as a game-time decision.</p>\n<p>The Penguins are the only NHL franchise without a Game 7 defeat as a visitor, and their 6-0 record on the road is the longest such winning streak in NHL history.</p>\n<p>The Rangers' all-time Game 7 record is 9-6, including a 7-1 mark at Madison Square Garden.</p>\n<p><em>ESPN's Emily Kaplan contributed to this report.</em></p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, who did not play in a Game 6 loss to the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>, skated with the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> on Saturday, coach Mike Sullivan said.</p>\n<p>Sources told ESPN on Friday that Crosby was held out of the 5-3 loss <a href=\"https://www.espn.com/nhl/story/_/id/33909805/pittsburgh-penguins-rule-sidney-crosby-game-6-vs-new-york-rangers\">with a concussion</a>. The Penguins have said only that he suffered an upper-body injury after taking a high hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a> in Game 5 on Wednesday.</p>\n<p>Crosby participated in the optional practice and did not wear a non-contact jersey, but Sullivan would not say if his star has been cleared for contact. Crosby also skated individually on Friday with skills coach Ty Hennes.</p>\n<p><alsosee></p>\n<p>Crosby had nine points in the first five games against the Rangers.</p>\n<p>Also returning to the ice Saturday was starting goaltender <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a>, who has yet to play in this playoff series due to injury, and winger <a href=\"http://www.espn.com/nhl/player/_/id/2562629/rickard-rakell\">Rickard Rakell</a>, who hasn't played since Game 1 after taking a hard hit.</p>\n<p>Sullivan did tell reporters that all players would be traveling to New York for Game 7 on Sunday.</p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> star <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> missed Friday's Game 6 loss to the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a> with a concussion, sources confirmed to ESPN's Emily Kaplan. </p>\n<p>Given the nature of head injuries, those close to Crosby told Kaplan it's unfair to speculate when he will return.</p>\n<p>The Rangers tied the opening round series at three games apiece. Game 7 is scheduled for Sunday in New York. </p>\n<p>Crosby suffered what the Penguins called an upper-body injury after taking a high hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a> in Wednesday night's Game 5 loss. The captain left the Penguins bench in the second period and did not return. Sullivan said Crosby did skate Friday with skills coach Ty Hennes and added that the team captain is \"in a good place.\"</p>\n<p>Center <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> skated in Crosby's usual spot with wingers <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a> and <a href=\"http://www.espn.com/nhl/player/_/id/2591155/bryan-rust\">Bryan Rust</a> during Friday's practice. Center <a href=\"http://www.espn.com/nhl/player/_/id/3648008/evan-rodrigues\">Evan Rodrigues</a>, who has three points in five playoff games, moved up from the team's fourth line to center <a href=\"http://www.espn.com/nhl/player/_/id/3151741/danton-heinen\">Danton Heinen</a> and <a href=\"http://www.espn.com/nhl/player/_/id/3114775/kasperi-kapanen\">Kasperi Kapanen</a>, who had been skating with Malkin. Rodrigues also moved into Crosby's spot on the Penguins' top power-play unit, where he appeared in Game 5 after Crosby's injury.</p>\n<p>After the hit from Trouba, Crosby took two additional shifts before leaving the game. Crosby finished his last shift with 6:50 left in the second period and did not return.</p>\n<p>The Rangers orchestrated a three-goal rally that erased a 2-0 Penguins lead and eventually won the game 5-3 to avoid elimination and force Game 6.</p>\n<p>Asked if he felt Trouba had any intent to injure on the hit, Sullivan said, \"Did you see the hit? You probably have the same opinion I do.\"</p>\n<p>On Thursday, the NHL opted against fining or suspending Trouba. A source told ESPN that the league's department of player safety didn't see any intent on the part of Trouba.</p>\n<p>Rangers coach Gerard Gallant said he wasn't concerned that Trouba would be suspended.</p>\n<p>\"As great a player as Sid is, he does a lot of twisting and turning and spinning away from guys,\" Gallant said. \"Troubs went to play the puck, and his elbow got up a little high on him. There was no intent. He wasn't trying to hurt anybody. Wasn't running people through the glass, that's for sure.\"</p>\n<p>Crosby has been one of the Stanley Cup playoffs' top performers and an MVP for the Penguins in their first-round series against the Rangers. He has nine points in five games for Pittsburgh, tallying two points in each of the first three games of the series and three points in the Penguins' Game 4 win.</p>\n<p>With Crosby on the ice this series, the Penguins have held a 58-18 advantage in scoring chances at 5-on-5.</p>\n<p>The Penguins were also without defenseman <a href=\"http://www.espn.com/nhl/player/_/id/5738/brian-dumoulin\">Brian Dumoulin</a>, who has been absent since Game 1, and <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a>, their starting goalie in the regular season who has missed the entire series with an injury.</p>\n<p>Goalie <a href=\"http://www.espn.com/nhl/player/_/id/2560083/louis-domingue\">Louis Domingue</a>, who replaced the injured <a href=\"http://www.espn.com/nhl/player/_/id/3025540/casey-desmith\">Casey DeSmith</a> in double overtime of Game 1, started Game 6.</p>\n<p>Penguins forward <a href=\"http://www.espn.com/nhl/player/_/id/2562629/rickard-rakell\">Rickard Rakell</a> was a game-time decision but ultimately sat out Game 6 as well. The winger, who was acquired at the trade deadline from the <a href=\"http://www.espn.com/nhl/team/_/name/ana/anaheim-ducks\">Anaheim Ducks</a>, hasn't played since Game 1 of the series after taking a hard hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/4271998/ryan-lindgren\">Ryan Lindgren</a>.</p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> is dealing with an upper-body injury and remains set for evaluation ahead of Friday's Game 6 against the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>, coach Mike Sullivan told reporters Thursday.</p>\n<p>Crosby was injured in the second period of Wednesday's <a href=\"https://www.espn.com/nhl/game/_/gameId/401434833\">5-3 loss</a> after taking a high hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a>. Crosby finished his last shift with 6:50 left in the period and did not return.</p>\n<p>Sullivan said Crosby would be evaluated after the Penguins return to Pittsburgh on Thursday.</p>\n<p><alsosee></p>\n<p>\"We can win games regardless of who is in our lineup,\" Sullivan said. \"We have a lot of depth at all of the positions. We believe we have what it takes to win. ... This group has always had the 'next man up' mentality.\"</p>\n<p>The coach declined to give further specifics about Crosby's injury or say whether Trouba's hit should lead to discipline from the NHL.</p>\n<p>The league said Thursday that Trouba will not have a hearing or be fined for his hit on Crosby.</p>\n<p>The Penguins led 2-0 when Crosby left the game. The Rangers would score three goals in less than three minutes during the second period and have narrowed the Penguins' series lead to 3-2.</p>\n<p>Crosby, a three-time Stanley Cup champion and two-time Hart Trophy winner, is tied for third in the playoffs in scoring with nine points in five games.</p>\n<p><em>ESPN's Greg Wyshynski contributed to this report.</em></p>\n\n\n\n\n",
  "<p><a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> is dealing with an upper-body injury and remains set for evaluation ahead of Friday's Game 6 against the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a>, coach Mike Sullivan told reporters Thursday.</p>\n<p>Crosby was injured in the second period of Wednesday's <a href=\"https://www.espn.com/nhl/game/_/gameId/401434833\">5-3 loss</a> after taking a high hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a>. Crosby finished his last shift with 6:50 left in the period and did not return.</p>\n<p>Sullivan said Crosby would be evaluated after the Penguins return to Pittsburgh on Thursday.</p>\n<p><alsosee></p>\n<p>\"We can win games regardless of who is in our lineup,\" Sullivan said. \"We have a lot of depth at all of the positions. We believe we have what it takes to win. ... This group has always had the 'next man up' mentality.\"</p>\n<p>The coach declined to give further specifics about Crosby's injury or say whether Trouba's hit should lead to discipline from the NHL.</p>\n<p>The league said Thursday that Trouba will not have a hearing or be fined for his hit on Crosby.</p>\n<p>The Penguins led 2-0 when Crosby left the game. The Rangers would score three goals in less than three minutes during the second period and have narrowed the Penguins' series lead to 3-2.</p>\n<p>Crosby, a three-time Stanley Cup champion and two-time Hart Trophy winner, is tied for third in the playoffs in scoring with nine points in five games.</p>\n<p><em>ESPN's Greg Wyshynski contributed to this report.</em></p>\n\n\n\n\n",
  "<p>The <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> failed to close out the <a href=\"http://www.espn.com/nhl/team/_/name/nyr/new-york-rangers\">New York Rangers</a> in their Game 5 loss on Wednesday night, but their attention afterward was on the loss of captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>.</p>\n<p>The Rangers <a href=\"https://www.espn.com/nhl/game/_/gameId/401434833\">won 5-3</a> to narrow the Penguins' series lead to 3-2.</p>\n<p>Game 6 is Friday night in Pittsburgh. The question now is whether Crosby, who is second in the Stanley Cup playoffs in scoring with nine points in five games, will be available for that contest.</p>\n<p>Crosby, a three-time Stanley Cup champion and a two-time Hart Trophy winner, was injured in the second period after taking a high hit from Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/2976839/jacob-trouba\">Jacob Trouba</a>. Crosby finished his last shift with 6:50 left in the period and did not return.</p>\n<p>Penguins coach Mike Sullivan said that Crosby was being evaluated and did not offer any information on the nature of the injury. As for the hit from Trouba, Sullivan said: \"Did you see the hit? You probably have the same opinion I do.\"</p>\n<p><alsosee></p>\n<p><alssoee></alssoee></p>\n<p>With Crosby sidelined, the Rangers roared back from a 2-0 deficit to take a 3-2 lead in the second period. New York forward <a href=\"http://www.espn.com/nhl/player/_/id/4233643/filip-chytil\">Filip Chytil</a>'s power-play goal in the third period broke a 3-3 tie and ended up as the game winner.</p>\n<p>The Rangers didn't have the best start to Game 5. Forward <a href=\"http://www.espn.com/nhl/player/_/id/5833/chris-kreider\">Chris Kreider</a> and Trouba both took minor penalties 24 seconds into the game, but New York was able to kill off the ensuing two-man advantage. The Penguins broke through at 10:28 of the first period, as forward <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a> collected a rebound from in back of the Rangers' net and banked the puck off of goalie <a href=\"http://www.espn.com/nhl/player/_/id/3151297/igor-shesterkin\">Igor Shesterkin</a>'s skate and into the net.</p>\n<p>It was 2-0 Penguins at 7:58 of the second period, as <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> found <a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a> for his first goal of the series.</p>\n<p>Pittsburgh was in control of the game when Rangers defenseman <a href=\"http://www.espn.com/nhl/player/_/id/4197146/adam-fox\">Adam Fox</a> finally broke through at 15:11 of the second period to bring Madison Square Garden back to life and reignite the New York offense. Rangers forward <a href=\"http://www.espn.com/nhl/player/_/id/4697382/alexis-lafreniere\">Alexis Lafreniere</a> scored one minute and 30 seconds later to knot it. Trouba scored on a great individual effort just one minute and 22 seconds after that to give the Rangers a 3-2 lead.</p>\n<p>The celebration was short-lived. Malkin, playing in Crosby's spot, found Guentzel for his second goal of the game and seventh of the playoffs to tie the game 3-3 -- just 13 seconds after Trouba's score.</p>\n<p>The Rangers earned their first power play of the game in the third period with defenseman <a href=\"http://www.espn.com/nhl/player/_/id/3114995/marcus-pettersson\">Marcus Pettersson</a> in the box for interference. Chytil scored his first of the playoff on the ensuring power play, giving the Rangers the lead at 2:53 of the third. <a href=\"http://www.espn.com/nhl/player/_/id/4271998/ryan-lindgren\">Ryan Lindgren</a> added an empty-netter, and the series shifted back to Pittsburgh -- where Crosby's status remains a mystery.</p>\n<p>\"We never want to see a player like that leave, but we have to find a way,\" Guentzel said. \"He's the best player in the world. That's a lot of minutes other guys have to take up. Next man up.\"</p>\n\n\n\n\n",
  "<p><video1></video1></p>\n<p>The ABC Saturday afternoon hockey schedule continues this week with a Metropolitan Division clash, as <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> and the <a href=\"http://www.espn.com/nhl/team/_/name/wsh/washington-capitals\">Washington Capitals</a> pay a visit to his old buddy <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> and the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a>, with coverage beginning at 3 p.m. ET and simulcast on ESPN+.</p>\n<p>To help get you ready for the game, we've put together a guide on all the key players to watch for each team, including in-depth statistical insights from ESPN Stats & Information, and more.</p>\n<p>This season, ESPN+ will broadcast 75 exclusive regular-season games, with ABC and ESPN airing a combined 28 exclusive regular-season games for a total of 103 games. <a href=\"https://espnpressroom.com/us/press-releases/2021/09/the-walt-disney-company-announces-103-exclusive-nhl-games-across-espn-espn-hulu-and-abc-beginning-october-12/\">The complete broadcast schedule can be found here</a>.</p>\n<p align=\"center\"><strong><a href=\"https://www.espn.com/espnplus/\">Subscribe to ESPN+</a> | <a href=\"https://www.espn.com/watch/catalog/1a5f0227-a13e-396c-8cea-8961bc288666/\">Stream the NHL on ESPN</a></strong></p>\n<p><img src=\"http://a.espncdn.com/i/infographics/20170710_nfl_fpr/charts/_end_rule.png\" width=\"100%\"></p>\n<p><img alt=\"\" class=\"floatleft\" src=\"http://a.espncdn.com/combiner/i?img=/i/teamlogos/nhl/500/wsh.png?w=110&h=110&transparent=true\" width=\"31\"><img alt=\"\" class=\"floatleft\" src=\"http://a.espncdn.com/combiner/i?img=/i/teamlogos/nhl/500/pit.png?w=110&h=110&transparent=true\" width=\"31\"></p>\n<h2><a href=\"http://www.espn.com/nhl/team/_/name/wsh/washington-capitals\">Washington Capitals</a> at <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a></h2>\n<p><strong><a href=\"https://www.espn.com/nhl/game/_/gameId/401350280\">3 p.m. ET</a> | <a href=\"https://www.espn.com/watch/catalog/1a5f0227-a13e-396c-8cea-8961bc288666/\">Watch live on ESPN+</a></strong><br>\n<strong>Line:</strong> Pittsburgh -140 | <strong>Over/under:</strong> 6</p>\n<p><strong>Capitals</strong><br>\n<strong><a href=\"https://www.espn.com/nhl/story/_/id/33678146/nhl-power-rankings-1-32-poll-plus-players-most-pressure-every-team\">ESPN Power Rankings</a>:</strong> 15<br>\n<strong>Leading scorer:</strong> <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a>, 81 points in 68 games<br>\n<strong>2021-22 record:</strong> 38-22-10 (86 points), fourth in Metro Division</p>\n<p><alsosee></p>\n<ul>\n<li>The Capitals have a 14-6-1 record against the Metropolitan Division this season, the best of any team within that division. That would be the team's third-best record against the Metro since the division was created in 2013-14.</li>\n<li>The Capitals come into Saturday's game with a roster that has an average age of 30.0 years, tied with the Islanders for the oldest in the league. The Penguins are tied for the fifth-oldest roster with the Wild at 29.3 years.</li>\n<li>Washington has struggled in the faceoff circle, ranking 28th overall (47.4%), last on the power play (46.1%) and 30th in offensive zone draws (45.3%). Among 87 qualifying players, <a href=\"http://www.espn.com/nhl/player/_/id/3946/lars-eller\">Lars Eller</a> ranks 56th (49.8%) and <a href=\"http://www.espn.com/nhl/player/_/id/5647/evgeny-kuznetsov\">Evgeny Kuznetsov</a> ranks 84th (43.7%) in faceoff win pct. </li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> stands at 773 goals, leaving him 28 away from tying Gordie Howe for second all-time (801). With 12 games left, if Ovechkin maintains his season pace, he'll finish with exactly 50 goals for the ninth time in his career, which would tie Wayne Gretzky and Mike Bossy for the most in NHL history.</li>\n<li>Ovechkin has reached 300 shots for a 15th time in his 17-year career (301), three more than any other player in NHL history. Only <a href=\"http://www.espn.com/nhl/player/_/id/4024123/auston-matthews\">Auston Matthews</a> (314) and <a href=\"http://www.espn.com/nhl/player/_/id/3114778/david-pastrnak\">David Pastrnak</a> (304) have taken more than Ovechkin this season.</li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/5118/john-carlson\">John Carlson</a> is one point shy of his fourth career 60-point season. Over the last five seasons, Carlson has the most assists (250) and points (316) by a defenseman.</li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/3666/nicklas-backstrom\">Nicklas Backstrom</a>'s points-per-game rate of 0.73 would be the lowest of his career. He still has 276 career assists on goals by Alex Ovechkin.</li>\n</ul>\n<hr>\n<p><strong>Penguins</strong><br>\n<strong><a href=\"https://www.espn.com/nhl/story/_/id/33678146/nhl-power-rankings-1-32-poll-plus-players-most-pressure-every-team\">ESPN Power Rankings</a>:</strong> 12<br>\n<strong>Leading scorer:</strong> <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, 72 points in 59 games<br>\n<strong>2021-22 record:</strong> 41-21-10 (92 points), third in Metro Division</p>\n<p><inline1></p>\n<ul>\n<li>The Penguins played without <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> in Thursday's 3-0 loss to the Rangers. They are 5-4-4 when Crosby is out of the lineup this season and 36-17-6 when he does play. One of the biggest differences without Crosby in the lineup is the power play, which converts 9.5% in the 13 games without him (they are at 21.5% overall). For context, the Flyers have the NHL's worst power-play rate at 12.6% this season.</li>\n<li>Pittsburgh's three-game losing streak is tied for the team's longest in regulation this season. A loss in regulation in this game would give the Penguins their second-longest losing streak over the last five seasons (6 straight from Feb. 20-29, 2020). Since March 15, the Penguins are 5-6-1 overall and a 2-6-0 mark against teams currently in playoff position, with both victories coming beyond regulation (3-2 shootout win at St. Louis on March 17 and a 4-3 OT win at Minnesota on March 31).</li>\n<li>The Penguins are second in penalty kill percentage this season, at 86.0%. They have finished in the top 2 in penalty kill percentage once in team history: 2010-11, when they led the league at 86.1%. Their current conversion rate would rank fourth-highest in a single season in team history (stat first tracked in 1977-78).</li>\n<li>Goalie <a href=\"http://www.espn.com/nhl/player/_/id/3042020/tristan-jarry\">Tristan Jarry</a> has lost four straight starts and is 1-5-0 in his last six appearances with an .891 save percentage. All five of those losses have come against the Rangers (3) and the Avalanche (2).</li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/2591155/bryan-rust\">Bryan Rust</a> has a career-high 57 points this season, 48 of which have come in the 2022 calendar year. The only Penguins player with more in that span is Crosby, with 54. The trio of Crosby, Rust and <a href=\"http://www.espn.com/nhl/player/_/id/3042083/jake-guentzel\">Jake Guentzel</a> have accounted for 35% of the Penguins goals this season. But since Jan. 1, it's up to 42%.</li>\n</ul>\n\n\n\n\n\n",
  "<p><video1></video1></p>\n<p>The ABC Saturday afternoon hockey schedule continues this week with a potential Stanley Cup Final matchup as <a href=\"http://www.espn.com/nhl/player/_/id/3041969/nathan-mackinnon\">Nathan MacKinnon</a> and the <a href=\"http://www.espn.com/nhl/team/_/name/col/colorado-avalanche\">Colorado Avalanche</a> host <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> and the <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a>, with coverage beginning at 3 p.m. ET and simulcast on ESPN+.</p>\n<p>To help get you ready for the game, we've put together a guide on all the key players to watch for each team, including in-depth statistical insights from ESPN Stats & Information, and more.</p>\n<p>This season, ESPN+ will broadcast 75 exclusive regular-season games, with ABC and ESPN airing a combined 28 exclusive regular-season games for a total of 103 games. <a href=\"https://espnpressroom.com/us/press-releases/2021/09/the-walt-disney-company-announces-103-exclusive-nhl-games-across-espn-espn-hulu-and-abc-beginning-october-12/\">The complete broadcast schedule can be found here</a>.</p>\n<p align=\"center\"><strong><a href=\"https://www.espn.com/espnplus/\">Subscribe to ESPN+</a> | <a href=\"https://www.espn.com/watch/catalog/1a5f0227-a13e-396c-8cea-8961bc288666/\">Stream the NHL on ESPN</a></strong></p>\n<p><img src=\"http://a.espncdn.com/i/infographics/20170710_nfl_fpr/charts/_end_rule.png\" width=\"100%\"></p>\n<p><img alt=\"\" class=\"floatleft\" src=\"http://a.espncdn.com/combiner/i?img=/i/teamlogos/nhl/500/pit.png?w=110&h=110&transparent=true\" width=\"31\"><img alt=\"\" class=\"floatleft\" src=\"http://a.espncdn.com/combiner/i?img=/i/teamlogos/nhl/500/col.png?w=110&h=110&transparent=true\" width=\"31\"></p>\n<h2><a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> at <a href=\"http://www.espn.com/nhl/team/_/name/col/colorado-avalanche\">Colorado Avalanche</a></h2>\n<p><strong><a href=\"https://www.espn.com/nhl/game?gameId=401350231\">3 p.m. ET</a> | <a href=\"https://www.espn.com/watch/catalog/1a5f0227-a13e-396c-8cea-8961bc288666/\">Watch live on ESPN+</a></strong><br>\n<strong>Line:</strong> Colorado -140 | <strong>Over/under:</strong> 6</p>\n<p><strong>Penguins</strong><br>\n<strong><a href=\"https://www.espn.com/nhl/story/_/id/33624498/nhl-power-rankings-1-32-poll-plus-way-too-early-trade-deadline-appraisals\">ESPN Power Rankings</a>:</strong> 6<br>\n<strong>Leading scorer:</strong> <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a>, 71 points in 57 games<br>\n<strong>2021-22 record:</strong> 41-18-10, third in Metro division</p>\n<p><alsosee></p>\n<ul>\n<li>The Penguins' 22 road wins are tied for fourth-most in a single season in franchise history and are two away from tying the club record set in 1992-93 (24-15-3) and tied in 2010-11 (24-11-6). Pittsburgh and Washington entered Friday tied for the highest road goal differential this season at +26. </li>\n<li>Pittsburgh has scored a power-play goal in each of the past six games and is scoring on 37.5% of its chances (9-for-24). The Pens' penalty kill has been strong all season, posting the second-best rate in the NHL at 85.6% behind only the Hurricanes (88.5%). It would be the team's fourth-best rate in a single season since the stat was first tracked in 1977-78. </li>\n<li>Sidney Crosby got going starting on Nov. 27 with a three-point game against Montreal and hasn't stopped since. His 68 points since Nov. 27 are tied with <a href=\"http://www.espn.com/nhl/player/_/id/2563039/johnny-gaudreau\">Johnny Gaudreau</a> for third-most in that span and trails only <a href=\"http://www.espn.com/nhl/player/_/id/2562606/jonathan-huberdeau\">Jonathan Huberdeau</a> (74) and <a href=\"http://www.espn.com/nhl/player/_/id/4024123/auston-matthews\">Auston Matthews</a> (69). If Crosby finishes the season averaging 1.00 points per game, he'll tie Gordie Howe for the second-most such seasons all time with 17, trailing only Wayne Gretzky (19 seasons). </li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/3539/kris-letang\">Kris Letang</a>'s 59 points are fifth-most among defensemen this season. His next point will give him the second 60-point season of his career (67 in 2015-16) and he would join <a href=\"http://www.espn.com/nhl/player/_/id/3006/mark-giordano\">Mark Giordano</a> in 2018-19 as the only defensemen age 34 or older in the past 10 seasons with a 60-point campaign. </li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a> has a point in six straight games. His 17 goals since making his season debut on Jan. 11 are second on the Penguins in that span, trailing only Crosby's 20. Malkin scored the game-winning goal in OT on Thursday, his 78th game winner of his career, which tied <a href=\"http://www.espn.com/nhl/player/_/id/405/jaromir-jagr\">Jaromir Jagr</a> for most in franchise history. </li>\n<li><a href=\"http://www.espn.com/nhl/player/_/id/2562629/rickard-rakell\">Rickard Rakell</a> came to the Penguins via a trade-deadline deal with the Ducks, and has three goals and five points in six games in Pittsburgh. Rakell's 19 goals this season leaves him one shy of his first 20-goal season since 2017-18 (34 with Anaheim). Last season, the Pens added <a href=\"http://www.espn.com/nhl/player/_/id/2383/jeff-carter\">Jeff Carter</a> at the deadline and he scored nine goals in 14 games after the deal.</li>\n</ul>\n<hr>\n<p><strong>Avalanche</strong><br>\n<strong><a href=\"https://www.espn.com/nhl/story/_/id/33624498/nhl-power-rankings-1-32-poll-plus-way-too-early-trade-deadline-appraisals\">ESPN Power Rankings</a>:</strong> 1<br>\n<strong>Leading scorer:</strong> <a href=\"http://www.espn.com/nhl/player/_/id/5349/nazem-kadri\">Nazem Kadri</a>, 83 points in 65 games<br>\n<strong>2021-22 record:</strong> 48-14-6, first in Central division</p>\n<p><inline1></p>\n<ul>\n<li>Colorado has scored a power-play goal in each of its past nine games, tied for the second-longest streak in the NHL this season with Toronto from Dec. 4 to Jan. 8, and one shy of tying the longest streak in the league this season (Edmonton: 10 from Oct. 13 to Nov. 5). The Avs converted 37% of their power plays in March (17-for-46), highest rate in the NHL, raising their season rate to 25.4%, which is fifth-best in the NHL. Equally strong lately has been their penalty kill, clicking at a league-best 90.6% since March 10 (killed 29-of-32 opposing power plays).</li>\n<li>The Avalanche have five players averaging better than 1.00 points per game this season: <a href=\"http://www.espn.com/nhl/player/_/id/3041969/nathan-mackinnon\">Nathan MacKinnon</a>, <a href=\"http://www.espn.com/nhl/player/_/id/3899938/mikko-rantanen\">Mikko Rantanen</a>, <a href=\"http://www.espn.com/nhl/player/_/id/5349/nazem-kadri\">Nazem Kadri</a>, <a href=\"http://www.espn.com/nhl/player/_/id/4233563/cale-makar\">Cale Makar</a> and <a href=\"http://www.espn.com/nhl/player/_/id/2562609/gabriel-landeskog\">Gabriel Landeskog</a>. No team has done that (min. 50 GP) in a season since the 1995-96 Penguins had six with <a href=\"http://www.espn.com/nhl/player/_/id/286/ron-francis\">Ron Francis</a>, Jagr, <a href=\"http://www.espn.com/nhl/player/_/id/1084/mario-lemieux\">Mario Lemieux</a>, <a href=\"http://www.espn.com/nhl/player/_/id/665/petr-nedved\">Petr Nedved</a>, <a href=\"http://www.espn.com/nhl/player/_/id/4320/tomas-sandstrom\">Tomas Sandstrom</a> and <a href=\"http://www.espn.com/nhl/player/_/id/1060/sergei-zubov\">Sergei Zubov</a>.</li>\n<li>The Avalanche's real struggles come in the faceoff circle, ranking 31st at 46.9% and ahead of only the Sabres (46.1%). Their defensive zone win percentage also ranks 31st, at 45.8%, ahead of only the Rangers (45.3%). </li>\n<li>Cale Makar leads all defensemen with 24 goals and already has the Avalanche single-season record for defenseman goals. His next assist will tie <a href=\"http://www.espn.com/nhl/player/_/id/95/ray-bourque\">Ray Bourque</a> (52) in 2000-01 for second-most by a defenseman in a single season in team history, and leave him only behind <a href=\"http://www.espn.com/nhl/player/_/id/234/steve-duchesne\">Steve Duchesne</a> (62) in 1992-93 (for the Quebec Nordiques). Makar's 75 points are second among defensemen this season behind <a href=\"http://www.espn.com/nhl/player/_/id/5436/roman-josi\">Roman Josi</a>'s 81. They are second-most in a single season in Avs history and are seven away from tying Duchesne's record of 82 in that 1992-93 campaign. </li>\n<li>Nazem Kadri leads the Avs in scoring with 83 points, which is 22 more than he ever scored previously in a season in his career. His 83 points are currently second-most among players who can become an unrestricted free agent this offseason (Johnny Gaudreau of the Flames has 91). </li>\n<li>If Nathan MacKinnon maintains a 1.30 PPG average for this season, it will be the fourth time he's done so in his career, which would tie him with <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a> for the third-most such seasons in the salary cap era (since 2005-06) and trail <a href=\"http://www.espn.com/nhl/player/_/id/3895074/connor-mcdavid\">Connor McDavid</a> (6) and Crosby (5, including this season).</li>\n</ul>\n\n\n\n\n\n",
  "<p><photo1></p>\n<p>Joe Manganiello is a \"we\" Pittsburgh sports fan.</p>\n<p>As in: \"We\" have a good shot at another Stanley Cup run this year.</p>\n<p>As in: \"We\" thought <a href=\"http://www.espn.com/nhl/player/_/id/1084/mario-lemieux\">Mario Lemieux</a> was done (before he un-retired).</p>\n<p>As in: \"We\" wouldn't have a hockey team at all anymore -- if it weren't for <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> (and maybe Lemieux, too).</p>\n<p>Yes, the love of all things Pittsburgh runs deep for Manganiello, a native Yinzer and actor by trade (catch him as a dancer in \"Magic Mike\" or as the pack master werewolf on \"True Blood\"). So, who better, really, to narrate the audio documentary \"Sidney Crosby: The Rookie Year\"?</p>\n<p>Manganiello could hardly turn down the opportunity. He had already won an Emmy award in 2017 as the narrator of another hockey doc, \"Pittsburgh is Home: The Story of the Penguins,\" and has maintained close ties to the organization. But if Manganiello thought he knew it all about Crosby, this latest project proved otherwise in revealing new facets of the <a href=\"https://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Penguins</a>' captain.</p>\n<p>\"There's no darkness in Sid, but there's an unbelievable toughness,\" Manganiello told ESPN. \"You find that out in this documentary, especially as it deals with going out to play against these other teams who are really gunning for him and [his having] a target on his back before he really got up and got started. People who are under that much pressure usually don't handle things the way that he has.\"</p>\n<p><alsosee></p>\n<p>The documentary covers all the details of Crosby's early ascent, tracking his phenom days in Cole Harbor, Nova Scotia, to the 2005 NHL draft, when Crosby was selected first overall, to playing -- and living -- with Lemieux, to his instant rivalry with <a href=\"http://www.espn.com/nhl/player/_/id/3101/alex-ovechkin\">Alex Ovechkin</a>.</p>\n<p>Crosby relives each chapter through his 18-year-old eyes, a young man bearing an enormous weight of responsibility. What impressed Manganiello in hearing Crosby's tale was how well Pittsburgh's forward rode the wave, by performing on the ice in a 102-point campaign and injecting life back into a franchise dealing with poor attendance and an uncertain future.</p>\n<p>\"In another profession, he would be considered a child star,\" Manganiello said. \"And we all know how that generally goes, unfortunately. But he could handle it; he was prime-time ready. And what was underneath all of that was the added pressure of the fact that the team was on the verge of bankruptcy and going to leave Pittsburgh.</p>\n<p>\"And so the fact that he remained disciplined in the face of all of that adversity, and that pressure, it really lifted the city and kept the team there. We wouldn't have a hockey team in Pittsburgh if it wasn't for him.\"</p>\n<p>Lemieux had a role in that too, of course. When the Penguins declared bankruptcy in 1998, he was their biggest creditor thanks to the $32.5 million in deferred salary he was owed. Lemieux had just retired in 1997, after playing through a diagnosis of Hodgkin's disease in 1993 and multiple back surgeries. But instead of pursuing a payout at the time, Lemieux and his group of investors made a deal to buy the team and keep it in Pittsburgh.</p>\n<p>That was a good thing because one of the NHL's next great superstars was on his way. And when Crosby arrived, he needed a place to stay.</p>\n<p>Once again, Lemieux stepped up. The Penguins legend invited Crosby to come live with him, wife Nathalie and their children. Crosby happily agreed to move in, sharing space with Lemieux at home and on the ice. Although not for long.</p>\n<p>Lemieux had made a successful comeback after un-retiring in 2000, even battling through treatment for atrial fibrillation in 2005. Health problems would catch up to him in Crosby's rookie season of 2005-06, and the two pillars of Pittsburgh hockey would play just 26 games together before Lemieux was sidelined for good by an irregular heartbeat in 2006.</p>\n<p><photo2></p>\n<p>The relationship Crosby had with his mentor remained strong, and Manganiello is convinced it's what helped kept Crosby grounded.</p>\n<p>\"The fact Crosby was 18 years old and Lemieux just said, 'Come and live with me in my house with my kids' says a lot,\" Manganiello said. \"Listen, I know a lot of hockey players and you don't want them around your kids. So that just shows Lemieux was a great judge of character. He had good people looking out for him, and I think it just goes to show you what we hope Pittsburgh is all about and what we hope Pittsburgh stands for, and those are two Canadian guys that are more Pittsburgh than anybody I know.\"</p>\n<p><inline1></p>\n<p>Manganiello then reverted to the collective \"we,\" referencing those who witnessed the real-time succession of their city's beloved hockey heroes.</p>\n<p>\"When those 26 games were up and Lemieux wasn't going to come back again, it was like that was it; that was all we got,\" Manganiello said. \"And having Sid carry on without him, to see Sid step into his own, and officially during those 26 games have that torch passed to him, and then to watch him take off on his own and become a star his own right was really special to be a part of and watch.\"</p>\n<p>Revisiting Crosby's first season for the documentary also underscored to Manganiello how far -- and how fast -- the Penguins' stalwart had to rise. Even now, at 34 years old and 17 seasons into his career, Crosby remains an elite, point-per-game player.</p>\n<p>That gives Manganiello hope not just for the Penguins' prospects this season, but that if he were to narrate the story of Crosby's final campaign, it wouldn't be for quite some time.</p>\n<p>\"After his last game, it would be me talking about his 1,000th goal and he's 50 years old, and he's still [trying to] go,\" Manganiello said. \"It could happen! But no, I mean we've got a shot this year. I hope we're going to be talking about Sid and winning a few more Cups.</p>\n<p>\"He's [such] a role model; he's aspirational. You want to point to him and tell kids, 'Look, you can do it the right way.' That's him, that's Crosby.\"</p>\n<p><em><a href=\"https://www.audible.ca/pd/Sidney-Crosby-The-Rookie-Year-Audiobook/B09SM5QHL3\">Sidney Crosby: Rookie Year</a> is available as part of Audible's Plus Catalogue membership. </em></p>\n\n\n\n",
  "<p>PITTSBURGH -- <a href=\"http://www.espn.com/nhl/team/_/name/pit/pittsburgh-penguins\">Pittsburgh Penguins</a> captain <a href=\"http://www.espn.com/nhl/player/_/id/3114/sidney-crosby\">Sidney Crosby</a> scored his 500th career goal Tuesday night, the second player in franchise history to do so.</p>\n<p>Crosby broke a 1-1 tie with the <a href=\"http://www.espn.com/nhl/team/_/name/phi/philadelphia-flyers\">Philadelphia Flyers</a> 16:34 into the first period, scoring on the power play with an assist from <a href=\"http://www.espn.com/nhl/player/_/id/3124/evgeni-malkin\">Evgeni Malkin</a>. The Penguins won in overtime, <a href=\"https://www.espn.com/nhl/game/_/gameId/401406947\">5-4</a>.</p>\n<p>Perhaps it was fitting that Malkin was represented in Crosby's goal, as the two superstars have been at the forefront of a franchise resurgence, leading the Penguins to three Stanley Cup titles since the two entered the league.</p>\n<p>\"You look back at different things over the last 17 years, and that's a memory I'll always hold close,\" Crosby said. \"With Geno assisting, with it being at home against Philadelphia, knowing the history of those two teams -- and getting the win at the end -- changes the whole dynamic.\"</p>\n<p>As the goal horn sounded around the PPG Paints Arena, the entire Penguins team joined Crosby in celebration along the sideboards next to Flyers goaltender <a href=\"https://www.espn.com/nhl/player/_/id/4064582\">Carter Hart</a>.</p>\n<p>\"Knowing Sid, the type of person he is, he wanted his teammates around him,\" Pittsburgh defenseman <a href=\"https://www.espn.com/nhl/player/_/id/3539\">Kris Letang</a> said. \"I think he wanted to remember that goal with everyone out there on the ice with him.\"</p>\n<p>The goal was Crosby's 14th of the season, and not long after the tally, the Penguins tweeted out a video from owner Mario Lemieux, the only other player in franchise history to get to 500. Lemieux, who led the Penguins to two Stanley Cup titles in the 1990s, finished his career with 690 goals.</p>\n<p>\"I've been able to witness most of them,\" Lemieux said of Crosby's tallies. \"And I'm sure there will be plenty more in the future.\"</p>\n<p><alsosee></p>\n<p>Crosby, who led the Penguins to a 4-2 win over the <a href=\"http://www.espn.com/nhl/team/_/name/nj/new-jersey-devils\">New Jersey Devils</a> on Sunday, played a shift at the end of that game with an open net on the other end of the ice, but never got a shot off, setting the stage for the feat on home ice against one of the franchise's fiercest rivals.</p>\n<p>The goal was Crosby's 50th against the Flyers, and it helped the Penguins secure an eighth-straight victory. The midseason rally, after a topsy-turvy start to the campaign, has the Penguins in first place in the Metropolitan Division.</p>\n<p>\"Wish he did it against somebody else, or at least we got the win,\" Philadelphia interim coach Mike Yeo said. \"Knowing him the way I do, it's hard to sit here and say I'm happy for him, but he's an incredible player.\"</p>\n<p>Crosby, 34, the No. 1 overall pick in 2005, has only played for the Penguins in his career, and though he's battled injuries this season, he appears at the top of his game. Tuesday was his 38th game of the season, and with an assist later in the third period, he now has 45 points and is averaging nearly 20 minutes time on the ice.</p>\n<p>His career high in goals came in the 2009-10 season, when he finished with 51, and he's topped 30 goals nine times.</p>\n<p>\"It's hard to put into words. Just being able to be part of some great teams over the years, play with some great players, it's a cool number,\" Crosby said of reaching 500. \"You look at the guys who have scored, it's a privilege to be part of that company.\"</p>\n<p><em>The Associated Press contributed to this report.</em></p>\n\n\n\n\n"
]